<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="addingfiles"><font size="5" face="Verdana"><strong>4.4: Adăugarea Fişierelor</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Fişierele pot fi copiate &icirc;n colecţie prin drag &amp; drop. Cursorul mouseului se estompează av&acirc;nd forma elementului selectat (iar dacă sunt selectate mai multe, &icirc;n numărul acestora). Elementele selectate sunt puse &icirc;n Arborele Colecţiei (dacă sursa a fost Arborele de Lucru) sau se pot muta &icirc;n cadrul aceleiaşi colecţii (dacă sursa a fost Arborele Colecţiei).</p>

<p>Atunci c&acirc;nd sunt copiate fişiere multiple, acestea sunt plasate &icirc;n directorul ţintă la acelaşi nivel indiferent de structura directorului din care provin. Atunci c&acirc;nd copiaţi un al doilea fişier av&acirc;nd acelaşi nume &icirc;n acelaşi director, vi se va cere dacă doriţi să-l suprascrieţi peste cel existent. Răspunz&acirc;nd cu &bdquo;Nu&rdquo; veţi anula copierea fişierului, dar cele care nu au astfel de conflicte vor fi totuşi copiate. Pentru a anula toate operaţiunile de copiere, apăsaţi pe butonul &bdquo;stop&rdquo;.</p>

<p>Doar cele mai &bdquo;&icirc;nalte&rdquo; elemente sin selecţie vor fi mutate. Un director este considerat pe o poziţie superioară faţă de copii săi. Nu pot fi selectate fişierele dintr-un director, precum şi directorul &icirc;nsuşi (fişierele sunt directorul).</p>

<p>Atunci c&acirc;nd adaugi un fişier, Interfaţa Bibliotecarului caută prin directoarele sursă după fişiere auxiliare ce conţin metadate atribuite anterior fişierelor adăugate, iar dacă acestea sunt găsite, se procedează la importul acestor metadate. Pe măsură ce se desfăşoară această operaţiune, vi se va cere (de c&acirc;teva ori) unele informaţii &icirc;n plus pentru metadatele importate care se aranjează după seturile de metadate ale colecţiei. Acest proces implică multe promptări distincte descrise &icirc;n secţiunea <a href="importingpreviouslyassignedmetadata.htm">Importarea Metadatelor Asignate Anterior</a>. Pentru o explicaţie mai detaliată a metadatelor asociate cu fişierele, puteţi citi Capitolul 2 din Ghidului Dezvoltatorului Greenstone -- Obţinerea a c&acirc;t mai mult din documentele colecţiei</p>

<p>Poţi să adaugi un document &bdquo;figurant&rdquo; la colecţie prin click-dreapta &icirc;n Arborele Colecţiei sau pe director, unde selectaţi &bdquo;Document figurant nou&rdquo;. Acest lucru va crea un nou fişier gol asupra căruia pot fi asignate metadate. Fişierul poate fi &icirc;nlocuit cu un fişier &bdquo;real&rdquo; la un moment ulterior.</p>

</body>
</html>
