<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="addingfiles"><font size="5" face="Verdana"><strong>4.4: A&ntilde;adiendo archivos</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Los archivos se pueden copiar arrastr&aacute;ndolos y coloc&aacute;ndolos en una colecci&oacute;n. El cursor se convierte en un fantasma del elemento seleccionado (o, si se ha seleccionado m&aacute;s de uno, del n&uacute;mero de ellos). Coloque la selecci&oacute;n en la estructura de directorios y subdirectorios de la colecci&oacute;n para copiar ah&iacute; los archivos (si la fuente son los archivos del &aacute;rea de trabajo) o mu&eacute;valos de lugar dentro de la misma colecci&oacute;n (si la fuente son los archivos de la colecci&oacute;n).</p>

<p>Cuando se copien varios archivos, todos estar&aacute;n ubicados al mismo nivel, sin importar la estructura de las carpetas en las que se encontraban originalmente. Cuando se copie un segundo archivo con el mismo nombre en la misma carpeta se le preguntar&aacute; si desea reemplazar el archivo existente. Si la respuesta es "No" entonces el archivo no se copiar&aacute;, pero los dem&aacute;s s&iacute;. Para cancelar las acciones restantes de copiado haga click en el bot&oacute;n "Detener". </p>

<p>&Uacute;nicamente se mover&aacute;n los elementos "de m&aacute;s alto nivel" en una selecci&oacute;n. Una carpeta est&aacute; a un nivel m&aacute;s alto que los elementos que se encuentran en su interior, por lo que no se podr&aacute;n seleccionar los archivos de una carpeta y la carpeta al mismo tiempo.</p>

<p>Cuando se a&ntilde;ada un archivo, la Interfaz de Bibliotecario buscar&aacute; a trav&eacute;s de las carpetas fuente los archivos auxiliares que contienen los metadatos asignados previamente a dicho archivo y, si encuentra alguno, empezar&aacute; a importar estos metadatos. Conforme la operaci&oacute;n siga adelante se le pedir&aacute; (quiz&aacute; varias veces) que proporcione informaci&oacute;n adicional para conciliar los metadatos importados con los conjuntos de metadatos de su colecci&oacute;n. Este proceso incluye muchos avisos diferentes, los cuales se describen en la secci&oacute;n <a href="importingpreviouslyassignedmetadata.htm">Importando metadatos previamente asignados</a>. Para obtener una explicaci&oacute;n m&aacute;s detallada sobre la forma de asociar metadatos a los archivos lea el Cap&iacute;tulo 2 de la Gu&iacute;a del Programador de Greenstone: Obteniendo el m&aacute;ximo beneficio de sus documentos.</p>

<p>Tambi&eacute;n puede a&ntilde;adir un documento "de prueba" a la colecci&oacute;n pulsando con el bot&oacute;n derecho en el &aacute;rbol de la colecci&oacute;n o en una carpeta, y seleccionando "Nuevo documento postizo". Esto crear&aacute; un documento vac&iacute;o al que se podr&aacute;n asignar metadatos. Este fcihero podr&aacute; ser reemplazado con un documento "real" m&aacute;s adelante.</p>

</body>
</html>
