<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="appendingmetadata"><font size="5" face="Verdana"><strong>5.3: Agregando nuevos metadatos</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Ahora a&ntilde;adiremos un &iacute;tem de metadato -- tanto un elemento como un valor -- a un archivo. Primero, seleccione el archivo en la estructura de directorios y subdirectorios de la colecci&oacute;n que se encuentra a la izquierda. Esto hace que cualquier metadato asignado previamente a este archivo aparezca en la tabla de la derecha.</p>

<p>A continuaci&oacute;n, seleccione el elemento de metadato que desea a&ntilde;adir haciendo click en la fila correspondiente de la tabla.</p>

<p>Escriba el valor en el campo de valores. Use el car&aacute;cter "|" para a&ntilde;adir estructura, tal y como se explica en <a href="theenrichview.htm">La pantalla de asignaci&oacute;n de metadatos</a>. Pulsando las teclas de flecha [Arriba] o [Abajo] se guardar&aacute;n los metadatos y se mover&aacute; la selecci&oacute;n adecuadamente. Pulsando [Retorno] se guardar&aacute;n los metadatos y se crear&aacute; una nueva entrada vac&iacute;a para un elemento de metadato, permitiendo asignar varios valores al mismo.</p>

<p>Tambi&eacute;n se pueden a&ntilde;adir metadatos a una carpeta o a varios archivos seleccionados al mismo tiempo. Estos metadatos se a&ntilde;adir&aacute; a todos los archivos que forman parte de la carpeta o de la selecci&oacute;n, as&iacute; como a las subcarpetas. Recuerde que si usted asigna metadatos a una carpeta, todos los archivos nuevos que se encuentren en ella heredar&aacute;n autom&aacute;ticamente los valores de la carpeta.</p>

</body>
</html>
