<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="assignlanguages"><font size="5" face="Verdana"><strong>6.4.3: Asignar idiomas</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Esta secci&oacute;n describe la forma de limitar los &iacute;ndices de b&uacute;squeda a ciertos idiomas. Esto se hace generando una partici&oacute;n por medio de la pesta&ntilde;a "Asignar idiomas" que se encuentra en la pantalla "Particionar &iacute;ndices".</p>

<p>Las particiones de idioma utilizan metadatos para determinar cuales documentos est&aacute;n en el idioma especificado y por ende deber&iacute;an incluirse en la partici&oacute;n. Greenstone genera el metadato "ex.Language" para la mayoria de los documentos, y este es el metadato por defecto ausar. De todas maneras, esto puede cambiarse configurando "Metadatos de Idioma:" en el metadato correcto.</p>

<p>Para a&ntilde;adir una nueva partici&oacute;n de idioma, seleccione uno o m&aacute;s idiomas en "Idioma que se va a a&ntilde;adir" y pulse en "A&ntilde;adir partici&oacute;n".</p>

<p>Para cambiar una partici&oacute;n existente, selecci&oacute;nela de la lista "Particiones de idioma asignadas", modifique los idiomas seleccionados en la lista "Idiomas a a&ntilde;adir", y pulse "Reemplazar partici&oacute;n".</p>

<p>Para quitar una partici&oacute;n de idioma, esc&oacute;jala de la lista "Particiones de idioma asignadas" y pulse en "Eliminar partici&oacute;n".</p>

<p>El orden en que se especifican las particiones de idioma en la la lista de Particiones de Didioma Asignadas es el orden en el que aparecen en el men&uacute; desplegable de la p&aacute;gina de b&uacute;squeda. Use los botones  "Mover arriba" y "Mover abajo" para cambiar el orden.</p>

<p>Para establecer un idioma predefinido, selecci&oacute;nelo de la lista y pulse en "Predeterminar".</p>

<p>Los nombres usados en la lista desplegable de particiones de idiomas en la p&aacute;gina de b&uacute;squeda puede fijarse en la parte "Buscar" del panel "Formato" (v&eacute;ase <a href="searchmetadatasettings.htm">Buscar</a>).</p>

</body>
</html>
