<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="classifiers"><font size="5" face="Verdana"><strong>6.5: Clasificadores de exploraci&oacute;n</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Esta secci&oacute;n explica la forma de asignar "clasificadores" a una colecci&oacute;n, que se usan para navegar y buscar en ella. En el panel "Dise&ntilde;o" pulse en "Clasificadores de exploraci&oacute;n".</p>

<p>Para a&ntilde;adir un clasificador, esc&oacute;jalo por medio de la lista descendente "Seleccione el clasificador que se va a a&ntilde;adir" en la parte inferior de la pantalla y pulse en "A&ntilde;adir clasificador". Con esto aparecer&aacute; una ventana titulada "Argumentos de configuraci&oacute;n". Las instrucciones para este cuadro de di&aacute;logo son exactamente las mismas que para los plugins (v&eacute;ase <a href="plugins.htm">Plugins</a>). Una vez que haya configurado el nuevo clasificador, &eacute;ste se a&ntilde;adir&aacute; al final de la lista de "Clasificadores asignados actualmente".</p>

<p>Para ver un descripci&oacute;n breve de un clasificador, selecci&oacute;nelo en la lista desplegable "Seleccione clasificador a a&ntilde;adir", y ponga el cursor sobre &eacute;l. Se mostrar&aacute; un mensaje emergente con la descripci&oacute;n.</p>

<p>Cada clasificador tiene varios argumentos que pueden configurarse. Los m&aacute;s importantes incluyen "metadato", que indica contra que metadato se clasificar&aacute;n los documentos, y "nombre de bot&oacute;n", que es el nombre con el que aparecer&aacute; el bot&oacute;n en el men&uacute; de navegaci&oacute;n</p>

<p>Para quitar un clasificador de la lista, selecci&oacute;nelo y haga click en "Eliminar clasificador".</p>

<p>Para cambiar los argumentos de un clasificador, selecci&oacute;nelo de la lista y pulse en "Configurar clasificador" (o doble pulsaci&oacute;n en el nombre del clasificador en la lista).</p>

<p>El orden de los clasificadores en la barra de navegaci&oacute;n de la colecci&oacute;n se refleja aqu&iacute;. Para cambiarlo, seleccione el clasificador que desea mover y haga click en "Mover arriba" o "Mover abajo".</p>

<p>Para mayor informaci&oacute;n sobre los clasificadores, lea el Cap&iacute;tulo 2 de la Gu&iacute;a del Programador de Greenstone: Obteniendo el m&aacute;ximo beneficio de sus documentos.</p>

</body>
</html>
