<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="depositormetadatasettings"><font size="5" face="Verdana"><strong>8.8: Metadatos del Acumulador</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>El Acumulador de Greenstone le permite al usuario agregar nuevos documentos a una colecci&oacute;n existente a trav&eacute;s de una interfaz web. Esta secci&oacute;n describe al panel de Metadatos del Acumulador, en donde puede especificar que metadatos deber&iacute;an usarse para describir nuevos documentos agregados a trav&eacute;s del Acumulador. Cualquier conjunto de metadatos que se haya asociado a la colecci&oacute;n actual estar&aacute; disponible para la selecci&oacute;n. Si no existiera otro conjunto m&aacute;s que el "Greenstone Extracted Metadatada Set" asociado a la colecci&oacute;n, entonces se usar&aacute; por defecto el conjunto de metadatos "Dublin Core". Para aprender m&aacute;s sobre el Acumulador, lea el ejercicio del tutorial online en  http://wiki.greenstone.org/wiki/gsdoc/tutorial/en/depositor.htm. En la solapa "Formato", seleccione "Metadatos del Acumulador".</p>

<p>El panel Metadatos del Acumulador muestra una lista de metadatos disponibles. Si hubiera m&aacute;s de un conjunto de metadatos asociados a la colecci&oacute;n entonces los conjuntos contiguos se mostrar&aacute;n en diferentes colores. Deslice el mouse sobre un elemento de metadato: se mostrar&aacute; un texto con la descripci&oacute;n del elemento. </p>

<p>Seleccione aquellos que quiera utilizar para describir nuevos documentos cuando estos sean cargados mediante el Acumulador. Aparecer&aacute; una lista desplegable al lado de cada elemento seleccionado con 2 opciones. Esto permite especificar el tipo de ingreso para ese elemento en la interfaz web. La opci&oacute;n "Text" significa un recuadro de texto simple, mientras que "textarea" significa que se usar&aacute; un recuadro de texto multil&iacute;nea. Seleccione el tipo apropiado para cada campo. </p>

<p>Debe seleccionarse un elemento de metadato como m&iacute;nimo. Si hubiera uno solo seleccionado en la lista, al desmarcarlo aparecer&aacute; un mensaje de aviso: "Por lo menos debe seleccionarse un metadato.".</p>

</body>
</html>
