<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="fileassociations"><font size="5" face="Verdana"><strong>9.2: Asociaci&oacute;n de archivos</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>La Interfaz de Bibliotecario utiliza diferentes programas de aplicaci&oacute;n para abrir tipos particulares de archivos. Para modificar la asociaci&oacute;n de archivos abra el men&uacute; "Archivo" y haga click en "Asociaci&oacute;n de archivos".</p>

<p>Para establecer una asociaci&oacute;n seleccione la extensi&oacute;n del fichero de la lista desplegable o escriba una nueva extensi&oacute;n (no incluya "."). A continuaci&oacute;n escriba en el campo correspondiente la orden que da inicio a la aplicaci&oacute;n deseada o elija la aplicaci&oacute;n en el cuadro "Explorar". "%1" se puede utilizar en la orden de inicio para insertar el nombre del archivo que se est&aacute; abriendo. Una vez que se han llenado estos campos, el bot&oacute;n "A&ntilde;adir" se activar&aacute;, con lo que ya se puede pulsar en &eacute;l para establecer la asociaci&oacute;n.</p>

<p>Para editar una asociaci&oacute;n, seleccione una extensi&oacute;n de ficheroo existente. la orden asociada aparecer&aacute; en el campo correspondiente a orden de inicio. Ed&iacute;telo y a continuaci&oacute;n pulse en "Reemplazar".</p>

<p>Para eliminar una asociaci&oacute;n, seleccione la extensi&oacute;n del archivo y haga click en "Eliminar".</p>

<p>Las asociaciones de archivos se guardan en la carpeta principal de la Interfaz de Bibliotecario en un archivo llamado "associations.xml".</p>

</body>
</html>
