<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="ofmiceandmenus"><font size="5" face="Verdana"><strong>1.1: De men&uacute;s y ratones</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Esta secci&oacute;n proporciona informaci&oacute;n b&aacute;sica para poder trabajar con la Interfaz de Bibliotecario. Si est&aacute; familiarizado con programas como Internet Explorer o Microsoft Office y est&aacute; acostumbrado a usar el mouse, entonces pase a la secci&oacute;n <a href="howtoavoidthisdocument.htm">Temas de ayuda</a>.</p>

<p>La Interfaz de Bibliotecario sigue las convenciones de Microsoft y se apoya en el conocimiento que com&uacute;nmente se tiene de Windows.</p>

<p>Cualquier parte de la pantalla con la que usted interact&uacute;e, como un bot&oacute;n o un campo de texto, se llama "control". En todo momento un bot&oacute;n o campo de texto llamado "control activo" aparecer&aacute; resaltado y responder&aacute; a las instrucciones del teclado. Asimismo, varios controles le permiten seleccionar las partes que est&eacute;n resaltadas en azul marino. Algunos controles tambi&eacute;n pueden aparecer sombreados para indicar que no est&aacute;n disponibles.</p>

<p>Usted puede mover y hacer click con el bot&oacute;n izquierdo o derecho del mouse de la forma acostumbrada. Muchos componentes tambi&eacute;n se pueden "arrastrar" haciendo click en ellos y sosteniendo el bot&oacute;n izquierdo del mouse, para luego moverlos y "colocarlos" en alg&uacute;n otro lugar soltando el bot&oacute;n. Normalmente el lugar de destino cambia de apariencia cuando un componente pasa sobre &eacute;l.</p>

<p>Puede usar el teclado para escribir en los campos de texto. La tecla de tabulaci&oacute;n [Tab] cambia la posici&oacute;n del cursor entre diferentes campos de texto.</p>

<p>Salga de la Interfaz de Bibliotecario eligiendo "Salir" en el men&uacute; "Archivo". Su colecci&oacute;n se guardar&aacute; primero.</p>

</body>
</html>
