<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="partitionindexes"><font size="5" face="Verdana"><strong>6.4: Particiones</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Los &iacute;ndices se construyen sobre fuentes de metadatos o textos espec&iacute;ficos. El espacio de b&uacute;squeda se puede controlar a&uacute;n m&aacute;s particionando el &iacute;ndice, ya sea por idioma o por medio de un filtro determinado previamente. Esta secci&oacute;n describe la forma de hacerlo. En la parte de "Dise&ntilde;oo" pulse en "&Iacute;ndices de partici&oacute;n".</p>

<p>La vista "Particionar &iacute;ndices" tiene tres pesta&ntilde;as: "Definir filtros", "Asignar particiones" y "Asignar idiomas". Para saber m&aacute;s acerca de las particiones y las subcolecciones revise el Cap&iacute;tulo 2 de la Gu&iacute;a del Programador de Greenstone.</p>

<p>Tenga en cuenta que para las colecciones MG, el n&uacute;mero total de particiones generadas es una combinaci&oacute;n de todos los &iacute;ndices, filtros de subcolecci&oacute;n e idiomas elegidos. Dos &iacute;ndices, con dos filtros de subcolecci&oacute;n en dos idiomas generar&aacute;n ocho particiones de &iacute;ndices. En MGPP, todos los &iacute;ndices son creados en un solo &iacute;ndice f&iacute;sico, por lo que solo habr&aacute; 4 particiones de &iacute;ndices. En Lucene, el n&uacute;mero de &iacute;ndices f&iacute;sicos est&aacute; determinado por el n&uacute;mero de niveles asignados a la colecci&oacute;n, un &iacute;ndice por nivel. Por ende, para la situaci&oacute;n anterior, un nivel resultar&iacute;a en cuatro &iacute;ndices f&iacute;sicos, mientras que dos niveles resultar&iacute;an en ocho.</p>




</body>
</html>
