<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="plugins"><font size="5" face="Verdana"><strong>6.2: Plugins</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Esta secci&oacute;n describe la forma de configurar los plugins que la colecci&oacute;n utiliza. Explica el modo de especificar los plugins que se utilizar&aacute;n, los par&aacute;metros que emplear&aacute;n y el orden en el que se aplicar&aacute;n. En la vista "Dise&ntilde;o" pulse en "Plugins de documento".</p>

<p>Para a&ntilde;adir un plugin, esc&oacute;jalo de la lista "Seleccione el plugin que se va a a&ntilde;adir" que se encuentra en la parte inferior de la pantalla y pulse en "A&ntilde;adir plugin". Aparecer&aacute; una ventana titulada "Argumentos de configuraci&oacute;n", la cual se explica m&aacute;s adelante. Una vez que usted haya configurado el nuevo plugin, este se a&ntilde;adir&aacute; al final de la lista de "Plugins asignados actualmente". Por lo general, se tendr&aacute; una sola instancia de cada plugin. De todas maneras, puede a&ntilde;adirse el mismo plugin m&aacute;s de una vez; en ese caso, las m&uacute;ltiples instancias se deber&iacute;an configurar de manera diferente para proveer un resultado &uacute;til, por ejemplo, configurando el argumento process_exp (ver http://wiki.greenstone.org/wiki/gsdoc/tutorial/en/enhanced_pdf.htm ). </p>

<p>Para ver una breve descripci&oacute;n del plugin, selecci&oacute;nelo en la lista desplegable "Seleccione plugins a a&ntilde;adir", y ponga el cursor sobre &eacute;l. Se mostrar&aacute; una nota emergente con la descripci&oacute;n.</p>

<p>Para quitar un plugin de la lista, selecci&oacute;nelo y haga click en "Eliminar plugin".</p>

<p>Los plugins se configuran por medio de argumentos. Para modificarlos, seleccione un plugin de la lista y haga click en "Configurar plugin" (o doble click en el plugin). Aparece un di&aacute;logo "Configurando Argumentos" con varios controles para especificar argumentos.</p>

<p>Existen diferentes tipos de controles. Algunos son recuadros y al hacer click en ellos se a&ntilde;ade la opci&oacute;n correspondiente al plugin. Otros son cadenas de texto con un recuadro y un campo de texto. Haga click en el cuadro para habilitarlo y escriba el argumento (expresi&oacute;n regular, ruta de archivo, etc.). Otros son men&uacute;s descendentes desde los que se puede seleccionar un conjunto dado de valores. Para saber lo que hace un argumento, coloque el cursor del mouse encima de su nombre y la descripci&oacute;n aparecer&aacute;.</p>

<p>Una vez que usted haya cambiado la configuraci&oacute;n, haga click en "Aceptar" para guardar los cambios y cerrar el cuadro de di&aacute;logo o en "Cancelar" para cerrar el cuadro de di&aacute;logo sin cambiar ning&uacute;n argumento.</p>

<p>Los plugins de la lista se ejecutan en orden y en ocasiones &eacute;ste es importante. Seleccione un plugin de la lista y use los botoness "Mover arriba" y "Mover abajo" para cambiar su posici&oacute;n.</p>

</body>
</html>
