<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="searchindexes"><font size="5" face="Verdana"><strong>6.3: &Iacute;ndices de b&uacute;squeda</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Los &iuml;ndices especifican que partes de la colecci&oacute;n son buscables. Esta secci&oacute;n explica como a&ntilde;adir y quitar &iacute;ndices, y c&oacute;mo fijar un &iacute;ndice predefinido. Bajo la pesta&ntilde;a  "Dise&ntilde;o", pulse "&Iacute;ndices de b&uacute;squeda".</p>

<p>La parte superior derecha del panel "&Iacute;ndices de b&uacute;squeda" muestra informaci&oacute;n sobre el indizador que est&aacute; usando la colecci&oacute;n. Puede cambiarse pulsando "Cambiar...". Se muestra una ventana emergente con una lista de opciones: MG, MGPP, y Lucene. Cambiarlo afecta a la forma en que se construyen los &iacute;ndices, y puede afectar a las funcionalidades de b&uacute;squeda.</p>

<p>La lista "&Iacute;ndices asignados" muestra los &iacute;ndices asignados a la colecci&oacute;n.</p>

<p>Para a&ntilde;adir un &iacute;ndice, pulsek "Nuevo &Iacute;ndice  "... Se mostrar&aacute; una ventana emergente con una lista de fuentes, que incluir&aacute; texto y metadatos. Seleccione que fuentes quiere indizar. Los botones "Seleccionar Todo  " y "No seleccionar ninguno" marcar&aacute;n o desmarcar&aacute;n todos los elementos de la lista respectivamente. Nua vez definido un nuevo &iacute;ndice, pulse "A&ntilde;adir &iacute;ndice" para a&ntilde;adirlo a la colecci&oacute;n. "A&ntilde;adir &iacute;ndice" s&oacute;lo se activar&aacute; una vez que se hayan definido par&aacute;metros para un &iacute;ndice que a&uacute;n no se ha asignado a la colecci&oacute;n.</p>

<p>Para los &iacute;ndices de MGPP, puede necesitar establecer la granularidad del &iacute;ndice, usando el men&uacute; "Nivel de Indizaci&oacute;n:".</p>

<p>Para los &iacute;ndices de MGPP y Lucene, la granularidad se establece globalmente, no por &iacute;ndice. Los niveles posibles se muestran en el panel principal "&Iacute;ndices de b&uacute;squeda", y pueden a&ntilde;adirse a la colecci&oacute;n marcando las casillas correspondientes.</p>

<p>Hay disponible un &iacute;ndice especial para MGPP y Lucene: un &iacute;ndice "todos los campos (allfields)" que ofrece una b&uacute;sqeuda combianda sobre todos los &iacute;ndices indicados, sin tener que indicar un &iacute;ndice separado que contenga todas las fuentes. Para a&ntilde;adir este &iacute;ndice pulse marque "A&ntilde;adir b&uacute;squeda combinada sobre todos los &iacute;ndices asignados (todos los campos)" y pulse "A&ntilde;adir &iacute;ndice". </p>

<p>Para MGPPP y Lucene se ofrece un bot&oacute;n "A&ntilde;adir Todo", como atajo para a&ntilde;adir todos los metadatos e fuentes de texto como &iacute;ndices individuales.</p>

<p>Para editar un &iacute;ndice, selecci&oacute;nelo y pulse "Editar &Iacute;ndice". Se muestra un di&aacute;logo similar a "Nuevo &Iacute;ndice".</p>

<p>Para borrar un &iacute;ndice, selecci&oacute;nelo de la lista de &iacute;ndices asignados y pulse "Eliminar &iacute;ndice".</p>

<p>El orden en el que se indican los &iacute;ndices en la Lista de &Iacute;ndices Asignados es el orden en el cual se muestran en el men&uacute; desplegable de la p&aacute;gina de b&uacute;squeda. Use los botones  "Mover arriba" y "Mover abajo" para cambiar este orden.</p>

<p>El preseleccionado en la p&aacute;gina de b&uacute;squeda es llamado "&iacute;ndice predefinido". Puede fijarse seleionando un &iacute;ndice de la lista y marcando "Predefinido". El &iacute;ndice predefinido es marcadao como "[&Iacute;ndice predefinido]" en la lista de "&Iacute;ndices Asignados". Si no se ha establecido, se usar&aacute; el primero.</p>

<p>Los nombres usados en la lista desplegable de &iacute;ndices de la p&aacute;gina de b&uacute;squeda puede fijarse en el panel "Buscar" de la vista "Formato" (v&eacute;ase <a href="searchmetadatasettings.htm">Buscar</a>).</p>


</body>
</html>
