<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="searchindexoptions"><font size="5" face="Verdana"><strong>6.3.1: Opciones de &iacute;ndices de b&uacute;squeda</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Hay algunas opciones adicionales que controlan la manera en la que se construyen los &iacute;ndices. Estas pueden no estar disponibles para un &iacute;ndice en particular, en cuyo caso se mostrar&aacute;n grisadas.</p>

<p>Truncamiento (Stemming) y Distinguir May/Min (case-folding) pueden habilitarse o deshabilitarse para los &iacute;ndices constru&iacute;dos con MG y MGPP. Si son habilitados, se crear&aacute;n &iacute;ndices que le permitir&aacute;n al usuario buscar usando dichas opciones o bien no tenerlas en cuenta. Si son deshabilitadas, las b&uacute;squedas seran sensitivas a las may&uacute;sculas y sin posibilidad de truncamiento y las opciones no se mostrar&aacute;n en la p&aacute;gina de preferencias de la colecci&oacute;n.</p>

<p>La distinci&oacute;n de acentos (Accent-folding) est&aacute; disponible para &iacute;ndices MGPP. Funciona de una manera similar a la distinci&oacute;n de may&uacute;sculas/min&uacute;sculas, pero en vez de hacer coincidir letras may&uacute;sculas y min&uacute;sculas logra la coincidencia de letras con diacr&iacute;ticos con aquellas que no lo tienen. El &iacute;ndice Lucene es accent-folded por defecto, pero no mostrar&aacute; ninguna opci&oacute;n al usuario en la p&aacute;gina de preferencias para habilitarlo o deshabilitarlo</p>

<p>El Texto escrito en Chino, Japon&eacute;s y Coreano por lo general no esta segmentado en palabras individuales. Como la indexaci&oacute;n se basa en las palabras presentes en el texto, esto resulta en un &iacute;ndice no buscable. Configurando la opci&oacute;n "Segmentaci&oacute;n de texto CJK" se agregar&aacute;n espacios entre cada caracter Chino/Japon&eacute;s/Coreano del texto y en los t&eacute;rminos de b&uacute;squeda, de forma que pueda efectuarse una b&uacute;squeda a nivel de caracter.</p>

</body>
</html>
