<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="theenrichview"><font size="5" face="Verdana"><strong>5.1: La pantalla de asignaci&oacute;n de metadatos</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Utilice la vista "Enriquecer" para asignar metadatos a los documentos de la colecci&oacute;n. Los metadatos son datos acerca de los datos: t&iacute;tulo, autor, fecha de creaci&oacute;n, etc. Cada metadato tiene dos partes: "Elemento" dice el tipo de metadato que es (como por ejemplo el autor) y "Valor" da la informaci&oacute;n de ese elemento (como por ejemplo el nombre del autor).</p>

<p>En la parte izquierda de la vista "Enriquecer" se encuentra el &aacute;rbol de la colecci&oacute;n. Toda la funcionalidad del bot&oacute;n derecho disponible para el &aacute;rbol de la colecci&oacute;n en "Reunir" tambi&eacute;n est&aacute; disponible aqu&iacute;. A la derecha est&aacute; la Tabla de Metadatos, que muestra los metadatos de los ficheros y carpetas seleccionados. Los nombres de las columnas est&aacute;n en gris en la parte superior y se pueden cambiar de tama&ntilde;o arrastrando la l&iacute;nea que las separa. Si se seleccionan varios archivos, el texto en negro indica que el valor es com&uacute;n a todos ellos, mientras que el texto sombreado indica que no. La edici&oacute;n de los valores en gris s&oacute;lo afecta a aquellos documentos con esos metadatos. Cualquier nuevo metadato introducido se a&ntilde;adir&aacute; a los valores seleccionados.</p>

<p>Un icono en forma de carpeta puede aparecer junto a algunas entradas de metadatos. Esto indica que los valores se heredan de la carpeta en la que se encuentra el archivo. Los metadatos heredados no se pueden editar o eliminar, sino &uacute;nicamente agregarse. Haga click en el icono de la carpeta para ir inmediatamente a la carpeta en la que se asignaron los metadatos.</p>

<p>Pulsando sobre el elemento de metadato en la tabla se mostrar&aacute;n los valores existentes  para ese elemento en el &aacute;rea "Valores existentes para ..." situada debajo de la tabla. La estructura de valores se puede expandir y contraer. Normalmente es una lista que muestra todos los valores introducidos previamente para un elemento seleccionado. Pulsando en una entrada &eacute;sta aparece autom&aacute;ticamente en el campo de valores. Y a la inversa, al escribir en el campo se selecciona la entrada de la estructura de valores que empieza con los caracteres introducidos. Al pulsar [Tab] se completa autom&aacute;ticamente el valor seleccionado.</p>

<p>Los valores de los metadatos se pueden organizar jer&aacute;rquicamente. Esto se muestra en la estructura de valores por medio de carpetas para los niveles internos. Los valores jer&aacute;rquicos pueden ingresarse utilizando el car&aacute;cter "|" para separar los niveles. Por ejemplo, se puede usar "Cartas|Rojo|Diamantes|Siete" en una jerarqu&iacute;a que representa un mazo de cartas. Esto permite agrupar los valores, en tanto que los grupos tambi&eacute;n pueden asignarse en forma de metadatos a los archivos.</p>

<p>Greenstone extrae autom&aacute;ticamente los metadatos de los documentos para formar un conjunto de metadatos cuyos elementos llevan el prefijo "ex.". &Eacute;ste no tiene estructura de valores y no puede editarse.</p>

</body>
</html>
