<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="thegatherview"><font size="5" face="Verdana"><strong>4.1: La pantalla de selecci&oacute;n de documentos</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Esta secci&oacute;n describe el funcionamiento de la pantalla "Reunir" que se utiliza para seleccionar los archivos que se van a incluir en la colecci&oacute;n que se est&aacute; construyendo. La Interfaz de Bibliotecario se inicia con la pantalla "Reunir". Para regresar a esta pantalla pulse en la pesta&ntilde;a "Reunir" que se encuentra directamente debajo de la barra de men&uacute;s.</p>

<p>Dos grandes &aacute;reas tituladas "Area de trabajo" y "Colecci&oacute;n" se utilizan para transferir los ficheros a su colecci&oacute;n. Cada una contiene "&aacute;rboles de archivos", que son representaciones gr&aacute;ficas de la estructura de directorios y ficheros.</p>

<p>Seleccione un elemento del &aacute;rbol pulsando en &eacute;l. (Tambi&eacute;n existen otras formas; v&eacute;ase m&aacute;s adelante.) Pulse dos veces en la carpeta, o una en el signo que se encuentra junto a ella para expandir (o contraer) sus contenidos. Pulse dos veces en un fichero y seleccione "Abrir en un programa externo" para abrirlo usando un programa de aplicaci&oacute;n asociado (v&eacute;ase <a href="fileassociations.htm">Asociaci&oacute;n de archivos</a>).</p>

<p>El &aacute;rbol de archivos del &aacute;rea de trabajo muestra los or&iacute;genes de la informaci&oacute;n disponible al interfaz del Bibliotecario -- el sistema local de archivos (incluyendo unidades de disco y CD-ROM), los contenidos de las colecciones existentes de Greenstone, y el cach&eacute; de archivos descargados. Usted puede copiar y consultar estos archivos pero no puede moverlos, eliminarlos o editarlos, con la excepci&oacute;n de los archivos descargados, los cuales pueden ser eliminados. Navegue por este espacio para buscar los archivos que desee incluir en la colecci&oacute;n.</p>

<p>La estructura de directorios y subdirectorios de la colecci&oacute;n muestra sus contenidos. Inicialmente est&aacute; vac&iacute;a.</p>

<p>Se puede cambiar el tama&ntilde;o de las &aacute;reas oprimiendo el bot&oacute;n del mouse sobre la barra gris que separa las estructuras de directorios y subdirectorios (la forma del cursor cambia) y arrastr&aacute;ndola.</p>

<p>En la parte inferior de la ventana se muestra un &aacute;rea de estado que informa del progreso de las acciones sobre archivos (copiando, moviendo y borrando). Puede tardar un tiempo en terminar. El bot&oacute;n "Detener" interrumpe cualquier acci&oacute;n que se est&eacute; ejecutando en ese momento.</p>

<p>Dos grandes botones ocupan la esquina inferior derecha de la pantalla: "Nueva carpeta", con la imagen de una carpeta, crea nuevas carpetas (vea la secci&oacute;n <a href="creatingfolders.htm">Creando carpetas</a>), en tanto que "Eliminar", con la imagen de un bote de basura, descarta los archivos. Al hacer click en el bot&oacute;n "Eliminar" se suprimir&aacute;n los archivos seleccionados de la estructura de directorios y subdirectorios de la colecci&oacute;n. Asimismo, los archivos pueden eliminarse arrastr&aacute;ndolos hacia este bot&oacute;n.</p>

<p>Para seleccionar varios elementos consecutivos, seleccione el primero y a continuaci&oacute;n manteniendo oprimida la tecla de may&uacute;sculas o [Shift] haga click en el &uacute;ltimo: la selecci&oacute;n incluir&aacute; todos los elementos que se encuentran en medio. Para seleccionar varios archivos que no sean consecutivos mantenga oprimida la tecla de control o [Ctrl] mientras hace click en ellos. Utilice alternativamente estos dos m&eacute;todos para seleccionar grupos de elementos que no est&eacute;n juntos.</p>

</body>
</html>
