<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="addingfiles"><font size="5" face="Verdana"><strong>4.4: Ajouter des fichiers</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les fichiers peuvent &ecirc;tre copi&eacute;s dans la collection par glisser-d&eacute;poser. Le pointeur prend la forme de l'&eacute;l&eacute;ment s&eacute;lectionn&eacute; (ou affiche le nombre d'&eacute;l&eacute;ments si la s&eacute;lection en comprend plus d'un). D&eacute;poser la s&eacute;lection dans l'arborescence de la collection pour les y copier (si la source est l'arborescence de l'espace de travail) ou les d&eacute;placer &agrave; l'int&eacute;rieur de la collection (si la source est l'arborescence de la collection).</p>

<p>Lorsque plusieurs fichiers sont copi&eacute;s, ils sont tous plac&eacute;s dans le dossier cible au m&ecirc;me niveau, quelle que soit la structure du dossier qui les contenait avant. Si vous copiez un fichier avec le nom d'un fichier qui existe d&eacute;j&agrave; dans le dossier cible, on vous demande si le premier fichier doit &ecirc;tre &eacute;cras&eacute;. Si la r&eacute;ponse est non, le fichier ne sera pas copi&eacute;, mais les autres le seront. Pour annuler les autres copies, cliquer sur le bouton &laquo;Arr&ecirc;t&raquo;.</p>

<p>Seuls les &eacute;l&eacute;ments prioritaires dans une s&eacute;lection sont d&eacute;plac&eacute;s. Un dossier est prioritaire relatif &agrave; son contenu. On ne peut pas s&eacute;lectionner en m&ecirc;me temps le contenu d'un dossier et le dossier lui-m&ecirc;me.</p>

<p>Lorsqu'un fichier est ajout&eacute;, l'Interface Biblioth&eacute;caire cherche les dossiers sources des fichiers auxiliaires contenant les m&eacute;tadonn&eacute;es qui lui sont assign&eacute;es &agrave; l'origine et, s'il en trouve, commence &agrave; les importer. Au fur et &agrave; mesure que l'op&eacute;ration se poursuit, il peut &ecirc;tre demand&eacute; (&eacute;ventuellement plusieurs fois) de fournir des informations compl&eacute;mentaires pour ajuster la m&eacute;tadonn&eacute;e aux jeux de m&eacute;tadonn&eacute;es de la collection. Ces confirmations sont d&eacute;crites dans la section <a href="importingpreviouslyassignedmetadata.htm">Importer des m&eacute;tadonn&eacute;es pr&eacute;-attribu&eacute;es</a>. Pour une explication plus d&eacute;taill&eacute;e de l'association de m&eacute;tadonn&eacute;es avec les fichiers, lire le chapitre 2 du Guide de d&eacute;veloppement de Greenstone -- &laquo;Exploitez vos documents au maximum&raquo;.</p>

<p>Vous pouvez aussi ajouter un document "factice" &agrave; la collection par un clic droit dans l'arborescence de la collection ou sur un dossier, et en s&eacute;lectionnant "Nouveau document factice". Cette op&eacute;ration va cr&eacute;er un fichier vide &agrave; laquelle les m&eacute;tadonn&eacute;es peuvent &ecirc;tre affect&eacute;s. Le fichier peut &ecirc;tre remplac&eacute; par un "vrai" fichier ult&eacute;rieurement.</p>

</body>
</html>
