<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="appendingmetadata"><font size="5" face="Verdana"><strong>5.3: Ajouter de nouvelles m&eacute;tadonn&eacute;es</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>On ajoute un &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es -- &eacute;l&eacute;ment et valeur &agrave; la fois -- &agrave; un fichier. S&eacute;lectionnez d'abord le fichier &agrave; partir de l'arborescence de la collection situ&eacute;e &agrave; gauche. Cette action entra&icirc;ne l'apparition de toute m&eacute;tadonn&eacute;e pr&eacute;-assign&eacute;e  dans le tableau de droite. </p>

<p>S&eacute;lectionnez ensuite l'&eacute;l&eacute;ment de m&eacute;tadonn&eacute;es &agrave; ajouter en cliquant sur sa rang&eacute;e dans le tableau.</p>

<p>Tapez la valeur dans le champ valeur. Utilisez le caract&egrave;re &laquo;|&raquo; pour structurer une m&eacute;tadonn&eacute;e, comme d&eacute;crit dans <a href="theenrichview.htm">La vue &laquo;Enrichir&raquo;</a>. Vous pouvez sauver la m&eacute;tadonn&eacute;e en pressant les touches [Haut] ou [Bas] et bouger ainsi le rang s&eacute;lectionn&eacute;. En pressant la touche [Ent&eacute;e] la m&eacute;tadonn&eacute;e sera sauv&eacute;e et un nouvel espace vide sera cr&eacute;&eacute; pour l' &eacute;l&eacute;ment, vous permettant d&rsquo;ajouter plusieurs valeurs &agrave; un m&ecirc;me &eacute;l&eacute;ment.</p>

<p>Vous pouvez aussi ajouter une m&eacute;tadonn&eacute;e &agrave; un dossier, ou &agrave; plusieurs fichiers s&eacute;lectionn&eacute;s &agrave; la fois. Elle est ajout&eacute;e &agrave; tous les fichiers &agrave; l'int&eacute;rieur du dossier ou de la s&eacute;lection, et aux sous-dossiers. Gardez &agrave; l'esprit que si des m&eacute;tadonn&eacute;es sont ajout&eacute;es &agrave; un dossier, tous les nouveaux fichiers de ce dossier h&eacute;ritent automatiquement de ces valeurs.</p>

</body>
</html>
