<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="assignlanguages"><font size="5" face="Verdana"><strong>6.4.3: Attribuer langues </strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section explique comment restreindre les index &agrave; des langues particuli&egrave;res. On le fait en g&eacute;n&eacute;rant une partition par le biais de l'onglet &laquo;Attribuer langues&raquo; du panneau &laquo;Index de Partition&raquo;.</p>

<p>Les partitions de langues utilisent les m&eacute;tadonn&eacute;es pour d&eacute;terminer quels sont les documents &eacute;crits dans la langue sp&eacute;cifi&eacute;e qui seront inclus dans la partition. Greenstone g&eacute;n&egrave;re la m&eacute;tadonn&eacute;e &laquo;ex.Language&raquo; pour la plupart des documents et celle-eci est la m&eacute;tadonn&eacute;&eacute; &agrave; utiliser par d&eacute;faut. Cependant, ce choix peut &ecirc;tre modifi&eacute; en sp&eacute;cifiant l'&eacute;l&eacute;ment de m&eacute;tadonn&eacute;es appropri&eacute;.</p>

<p>Pour ajouter une nouvelle partition de langue, s&eacute;lectionnez la ou les langue(s) souhait&eacute;e(s) dans la liste &laquo;Langue &agrave; ajouter&raquo; et cliquez sur &laquo;Ajouter partition&raquo;.</p>

<p>Pour modifier une partition existante, s&eacute;lectionnez-la dans la liste &laquo;Partitions de langue attribu&eacute;es&raquo;, modifiez les langues s&eacute;lectionn&eacute;es dans la liste &laquo;Langue &agrave; ajouter&raquo; au-dessous, puis cliquez sur "Remplacer la partition".</p>

<p>Pour supprimer une partition de langue, s&eacute;lectionnez-la dans la liste &laquo;Partitions de langue attribu&eacute;es&raquo; et cliquez sur &laquo;Supprimer partition&raquo;. </p>

<p>L'ordre des partitions de langue dans la liste "Partitions de Langue attribu&eacute;es" est l'ordre dans lequel o&ugrave; elles apparaissent dans la liste d&eacute;roulante de la page de recherche. Utilisez les boutons "D&eacute;placer vers le haut" et "D&eacute;placer vers le bas" pour modifier cet ordre.</p>

<p>Pour appliquer une langue par d&eacute;faut, s&eacute;lectionnez-la dans la liste et cliquez sur &laquo;D&eacute;finir d&eacute;faut&raquo;.</p>

<p>Les noms utilis&eacute;s pour la liste d&eacute;roulante des partitions de langue sur la page de recherche peuvent &ecirc;tre d&eacute;finis dans la partie "Recherches" du panneau "Formater" (voir <a href="searchmetadatasettings.htm">Recherches</a>).</p>

</body>
</html>
