<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="assignpartitions"><font size="5" face="Verdana"><strong>6.4.2: Attribuer des partitions</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Apr&egrave;s avoir d&eacute;fini des filtres de sous-collection, utilisez l'onglet &laquo;Attribuer des partitions&raquo; pour construire leurs index. S&eacute;lectionnez le filtre (ou les filtres) de votre choix &agrave; partir de la liste &laquo;Construire la partiition sur :&raquo; et cliquer sur &laquo;Ajouter partition&raquo;. Chaque partition attribu&eacute;e cr&eacute;e une sous-collection qui contient les documents qui correspondent &agrave; au moins un des filtres assign&eacute;s &agrave; cette partition.</p>

<p>Pour modifier une partition, s&eacute;lectionnez-la dans la liste, modifier les filtres, puis cliquez sur "Remplacer la partition".</p>

<p>Pour supprimer une partition, s&eacute;lectionnez-la dans la liste et cliquer sur &laquo;Supprimer partition&raquo;.</p>

<p>L'ordre dans lequel les partitions sont sp&eacute;cifi&eacute;es dans la liste de Partitions attribu&eacute;es est l'ordre o&ugrave; elles apparaissent dans la liste d&eacute;roulante de la page de recherche. Utilisez les boutons "D&eacute;placer vers le haut" et "D&eacute;placer vers le bas" pour modifier cet ordre.</p>

<p>Pour faire d'une partition celle par d&eacute;faut, s&eacute;lectionner-la &agrave; partir de la liste et cliquer sur "D&eacute;finir d&eacute;faut".</p>

<p>Les noms utilis&eacute;s pour la liste d&eacute;roulante des partitions sur la page de recherche peuvent &ecirc;tre d&eacute;finis dans le panneau "Recherches" de la vue "Formater" (voir <a href="searchmetadatasettings.htm">Recherches</a>).</p>

</body>
</html>
