<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="classifiers"><font size="5" face="Verdana"><strong>6.5: Classificateurs de navigation</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section explique comment assigner &agrave; une collection des &laquo;classificateurs&raquo; qui sont utilis&eacute;s pour naviguer. Dans la vue &laquo;Param&eacute;trer&raquo;, cliquez sur &laquo;Classificateurs de navigation&raquo;.</p>

<p>Pour ajouter un classificateur, s&eacute;lectionnez-le en utilisant la liste d&eacute;roulante &laquo;S&eacute;lectionner classificateur &agrave; ajouter&raquo; et cliquez sur &laquo;Ajouter classificateur&raquo;. Une fen&ecirc;tre intitul&eacute;e &laquo;Veuiller configurer les arguments&raquo; appara&icirc;t ; les instructions concernant ce dialogue sont les m&ecirc;mes que pour les plugiciels (voir <a href="plugins.htm">Plugiciels de document</a>). Une fois le nouveau classificateur configur&eacute;, il s'ajoute &agrave; la fin de la liste des "Classificateurs attribu&eacute;s". </p>

<p>Pour voir une br&egrave;ve description d'un classificateur, s&eacute;lectionnez-le dans la liste d&eacute;roulante &laquo;S&eacute;lectionner classificateur &agrave; ajouter&raquo;, puis placez le curseur dessus. Une infobulle affiche alors la description.</p>

<p>Chaque classificateur a plusieurs arguments qui peuvent &ecirc;tre configur&eacute;s. Les arguments les plus importants sont &laquo;m&eacute;tadonn&eacute;es&raquo;, qui pr&eacute;cise les m&eacute;tadonn&eacute;es&agrave; partir desquelles les documents seront class&eacute;s, et &laquo;Nom de bouton&raquo;, qui est le nom qui appara&icirc;tra dans la barre de navigation.</p>

<p>Pour supprimer un classificateur, s&eacute;lectionnez-le dans la liste et cliquez sur &laquo;Supprimer classificateur&raquo;.</p>

<p>Pour modifier les arguments d'un classificateur, s&eacute;lectionnez-le dans la liste et cliquez sur &laquo;Configurer classificateur&raquo; (ou double-clic sur le classificateur dans la liste.) </p>

<p>L'ordre des classificateurs dans la barre de navigation de la collection est le m&ecirc;me que celui de la liste de classificateurs attribu&eacute;s. Pour modifier l'ordre, s&eacute;lectionnez le classificateur &agrave; d&eacute;placer et cliquez sur "D&eacute;placer vers le haut" ou "D&eacute;placer vers le bas".</p>

<p>Pour plus d'informations sur les classificateurs, lisez le chapitre 2 du Guide du D&eacute;veloppeur Greenstone -- Exploitez vos documents au maximum.</p>

</body>
</html>
