<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="definefilters"><font size="5" face="Verdana"><strong>6.4.1: D&eacute;finir les filtres</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les filtres permettent de regrouper en sous-collection tous les documents dans un index pour laquelle une valeur de m&eacute;tadonn&eacute;e correspond &agrave; des crit&egrave;res donn&eacute;s.</p>

<p>Pour cr&eacute;er un filtre, cliquez sur le bouton &laquo;D&eacute;finir les Filtres&raquo; et entrez un nom pour le nouveau filtre dans le champ &laquo;Nom du filtre de sous-collection&raquo;. Ensuite choisissez un attribut de document (soit un &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es soit le nom du fichier) qui doit correspondre &agrave; des crit&egrave;res. Saisissez une expression r&eacute;guli&egrave;re pour d&eacute;finir les crit&egrave;res de la correspondance. Vous pouvez choisir d'&laquo;Inclure&raquo; les documents qui correspondent aux crit&egrave;res ou de les &laquo;Exclure&raquo;. Enfin, on peut sp&eacute;cifier des drapeaux standard des expressions r&eacute;guli&egrave;res PERL &agrave; utiliser pour la correspondance (par exemple &laquo;i&raquo; pour les correspondances ne tenant pas compte de la casse). Pour finir, cliquez sur &laquo;Ajouter filtre&raquo; pour ajouter le filtre &agrave; la liste &laquo;Filtres de sous-collection d&eacute;finis&raquo;. </p>

<p>Pour enlever un filtre, s&eacute;lectionnez-le dans la liste et cliquer sur &laquo;Supprimer filtre&raquo;.</p>

<p>Pour modifier un filtre, s&eacute;lectionnez-le sur la liste, changez au moins une des valeurs apparaissant dans les contr&ocirc;les de r&eacute;vision et cliquez sur &laquo;Remplacer filtre&raquo; pour valider les modifications.</p>

<p>D&eacute;finir les filtres ne cr&eacute;e pas de sous-collections. Les sous-collections sont sp&eacute;cifi&eacute;es dans "Attribuer des partitions", sur la base des filtres que vous venez de d&eacute;finir.</p>

</body>
</html>
