<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="depositormetadatasettings"><font size="5" face="Verdana"><strong>8.8: M&eacute;tadonn&eacute;es du D&eacute;posant</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Le D&eacute;posant de Greenstone permet d'ajouter de nouveaux documents &agrave; une collection existante par l'int&eacute;rm&eacute;diare d'une interface web. Cette section d&eacute;crit le panneau M&eacute;tadonn&eacute;es du D&eacute;posant, dans lequel vous pouvez pr&eacute;ciser les &eacute;l&eacute;ments de m&eacute;tadonn&eacute;es &agrave; utiliser pour d&eacute;crire les nouveaux documents &agrave; ajouter via le D&eacute;posant. Tout jeu de m&eacute;tadonn&eacute;es qui est associ&eacute; &agrave; la collection active sera disponible pour s&eacute;lection. S'il n'y aucun jeu de m&eacute;tadonn&eacute;es autre que le &laquo;Greenstone Extracted Metadata Set&raquo; associ&eacute; &agrave; la collection, le &laquo;El&eacute;ments de m&eacute;tadonn&eacute;es du Dublin Core&raquo; est utilis&eacute; par d&eacute;faut. Pour en savoir plus sur le D&eacute;posant, voir l'exercice tutoriel en ligne &agrave; adresse http://wiki.greenstone.org/wiki/gsdoc/tutorial/en/depositor.htm. Dans la vue Format, cliquez sur &laquo;M&eacute;tadonn&eacute;es du D&eacute;posant&raquo;.</p>

<p>Le panneau M&eacute;tadonn&eacute;es du D&eacute;posant affiche une liste d'&eacute;l&eacute;ments de m&eacute;tadonn&eacute;es disponsibles. S'il y a plus d'un jeu de m&eacute;tadonn&eacute;es associ&eacute; &agrave; la collection, des jeux voisins sont affich&eacute;s en couleurs diff&eacute;rentes. Si vous placez la souris sur un &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es, une infobulle contenant sa description s'affichera.</p>

<p>Cochez ceux que vous voulez utiliser pour d&eacute;crire les nouveaux documents &agrave; d&eacute;poser via le D&eacute;posant. Une liste d&eacute;roulante avec deux options appa&icirc;tra &agrave; c&ocirc;t&eacute; de chaque &eacute;l&eacute;ment coch&eacute;. Ceci permet de pr&eacute;ciser le type de zone d'entr&eacute;e &agrave; afficher dans l'interface web. &laquo;text&raquo; signifie qu'un cadre acceptant une seule ligne de texte sera affich&eacute;, tandis que &laquo;textarea&raquo; signifie qu'un cadre multiligne sera affich&eacute;. Selectionnez le type de zone appropri&eacute; &agrave; chaque champ.</p>

<p>Un &eacute;l&eacute;ment au moins de m&eacute;tadonn&eacute;es doit &ecirc;tre s&eacute;lectionn&eacute;. S'il n'y a qu'un &eacute;l&eacute;ment s&eacute;lectionn&eacute;, le d&eacute;cocher d&eacute;clenchera un message d'avertissement : "Au moins un &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es doit &ecirc;tre s&eacute;lectionn&eacute;."</p>

</body>
</html>
