<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="expertbuilding"><font size="5" face="Verdana"><strong>7.3: La vue &laquo;Cr&eacute;er&raquo; en mode Expert</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>En mode expert, vous pouvez utiliser l'entr&eacute;e &laquo;Journal de messages&raquo; &agrave; gauche pour revoir les tentatives pr&eacute;c&eacute;dentes de construction de la collection, avec ou sans succ&egrave;s. S&eacute;lectionnez le journal souhait&eacute; en cliquant sur la date correspondante dans la liste &laquo;Historique des journaux&raquo;.</p>

<p>Dans ce mode, une liste compl&egrave;te d'options d'importation et de construction sont indiqu&eacute;es dans les onglets &laquo;Options d'importation&raquo; et &laquo;Options de construction&raquo; &agrave; gauche. Les diff&eacute;rents param&egrave;tres sont contr&ocirc;l&eacute;s, tout comme dans la fen&ecirc;tre &laquo;Veuiller configurer les arguments&raquo; d&eacute;crite dans la section <a href="plugins.htm">Plugiciels de document</a>. Certains champs requi&egrave;rent des arguments num&eacute;riques, vous pouvez les taper ou utiliser les fl&egrave;ches pour augmenter ou diminuer la valeur actuelle (dans certains cas, l'interface limite la gamme &agrave; laquelle vous pouvez acc&eacute;der). D'autres sont activ&eacute;s en cliquant sur une case &agrave; cocher (cliquez de nouveau pour d&eacute;sactiver).</p>

<p>Pour plus d'informations sur l'importation et la construction lire le chapitre 1 du Guide du d&eacute;veloppeur Greenstone -- Comprendre le processus de construction d'une collection.</p>

</body>
</html>
