<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="formatstatements"><font size="5" face="Verdana"><strong>8.4: Caract&eacute;ristiques de format</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les pages web que vous voyez en utilisant Greenstone ne sont pas pr&eacute;-stock&eacute;s mais sont g&eacute;n&eacute;r&eacute;es &laquo;&agrave; la vol&eacute;e&raquo; au fur et &agrave; mesure qu'on en fait appel. Les commandes de format sont utilis&eacute;es pour modifier l'apparence de ces pages g&eacute;n&eacute;r&eacute;es. Elles d&eacute;terminent le lieu d'apparition des boutons lorsqu'un document est visualis&eacute;, ainsi que les liens qui sont affich&eacute;s par le classificateur DateList. Les commandes de format ne sont pas faciles &agrave; manier, et la lecture du chapitre 2 du Guide du D&eacute;veloppeur Greenstone est recommand&eacute;e. Cette section concerne les param&egrave;tres du formatage, et indique comment l'Interface Biblioth&eacute;caire en fournit l'acc&egrave;s. Dans la vue &laquo;Formater&raquo;, cliquez sur &laquo;Caract&eacute;ristiques de format&raquo;.</p>

<p>On peut appliquer une commande de format &agrave; n'importe quoi dans la liste d&eacute;roulante &laquo;Choisir caract&eacute;ristique&raquo; qui comprend tous les classificateurs de m&ecirc;me qu'une liste pr&eacute;d&eacute;finie de caract&eacute;ristiques. Deux types de contr&ocirc;les existent lorsqu'on s&eacute;lectionne une caract&eacute;ristique: Certaines caract&eacute;ristiques sont simplement activ&eacute;es ou d&eacute;sactiv&eacute;es, et le contr&ocirc;le se fait gr&acirc;ce &agrave; des cases &agrave; cocher. D'autres requi&egrave;rent une cha&icirc;ne de format.Il existe alors une liste d&eacute;roulante (&laquo;Composante affect&eacute;e&raquo;) pour la s&eacute;lection des parties de la caract&eacute;ristique &agrave; laquelle s'applique la cha&icirc;ne (si n&eacute;cessaire), une zone de texte (&laquo;Cha&icirc;ne au format HTML&raquo;) o&ugrave; l'on saisit la cha&icirc;ne, et une s&eacute;lection de &laquo;Variables&raquo; pr&eacute;d&eacute;finies. Pour ins&eacute;rer une variable dans une cha&icirc;ne de format, positionnez le curseur &agrave; l'endroit ou vous voulez l'ins&eacute;rer, puis s&eacute;lectionnez la variable d&eacute;sir&eacute;e dans la liste "Ins&eacute;rer la variable...".</p>

<p>Vous pouvez sp&eacute;cifier un format par d&eacute;faut pour une composante donn&eacute;e en s&eacute;lectionnant &laquo;Toutes les caract&eacute;ristiques&raquo;. Ce format est alors appliqu&eacute; &agrave; toutes les caract&eacute;ristiques applicables sauf si un autre format a &eacute;t&eacute; d&eacute;fini au pr&eacute;alable.</p>

<p>Pour ajouter une nouvelle commande de format, s&eacute;lectionnez la caract&eacute;ristique et composante appropri&eacute;es. La valeur par d&eacute;faut pour cette commande s'affiche en gris. Cliquez sur "Ajouter le format" pour l'attribuer &agrave; la collection. La &laquo;Cha&icirc;ne au format HTML&raquo; peut alors &ecirc;tre modifi&eacute;e. Une seule commande de format peut &ecirc;tre attribu&eacute;e pour chaque combinaison caract&eacute;ristique/composante.</p>

<p>Pour enlever une commande de format, s&eacute;lectionnez-la dans la liste et cliquez sur &laquo;Supprimer format&raquo;.</p>

<p>Pour de plus amples informations sur les variables et les composantes de caract&eacute;ristiques, lisez le chapitre 2 du Guide du D&eacute;veloppeur de Greenstone. </p>

</body>
</html>
