<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="generalsettings"><font size="5" face="Verdana"><strong>8.2: G&eacute;n&eacute;ral</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section explique comment passer en revue et modifier les r&eacute;glages g&eacute;neraux associ&eacute;s &agrave; la collection. Dans la vue "Param&eacute;trer" cliquez sur "General".</p>

<p>Ici quelques m&eacute;tadonn&eacute;es qui concernent la collection dans son ensemble peuvent &ecirc;tre saisies ou modifi&eacute;es, y compris le titre et la description qui sont demand&eacute;s lors de la cr&eacute;ation de la collection.</p>

<p>On demande tout d'abord les contacts e-mail du cr&eacute;ateur de la collection et de celui qui en assure la maintenance. Le champ suivant permet de modifier le titre de la collection. Le dossier dans lequel est enregistr&eacute; la collection est affich&eacute; ensuite, mais ne peut &ecirc;tre modifi&eacute;. Le champ suivant sp&eacute;cifie (sous forme d'URL) l'ic&ocirc;ne de l'extr&eacute;mit&eacute; sup&eacute;rieure gauche de la page &laquo;A propos&raquo; de la collection et celui juste apr&egrave;s sp&eacute;cifie l'ic&ocirc;ne utilis&eacute;e pour acc&eacute;der &agrave; la collection &agrave; partir de la page d'accueil de la biblioth&eacute;que Greenstone. Puis, une case permet de contr&ocirc;ler si la collection est accessible au public. Enfin, il y a la zone texte de la &laquo;Description de la collection&raquo; comme d&eacute;crit dans <a href="creatingacollection.htm">Cr&eacute;er une nouvelle collection</a>.</p>

</body>
</html>
