<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="importingpreviouslyassignedmetadata"><font size="5" face="Verdana"><strong>5.7: Importer des m&eacute;tadonn&eacute;es pr&eacute;-attribu&eacute;es</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section explique comment importer des m&eacute;tadonn&eacute;es attribu&eacute;es pr&eacute;c&eacute;demment (c'est-&agrave;-dire des m&eacute;tadonn&eacute;es attribu&eacute;es avant d'ajouter des documents &agrave; la collection). </p>

<p>Si la m&eacute;tadonn&eacute;e pr&eacute;alablement attribu&eacute;e &agrave; un fichier est dans un format reconnu par l'Interface Biblioth&eacute;caire -- par exemple, quand on choisit des documents dans une collection Greenstone existante -- elle est import&eacute;e automatiquement quand on ajoute le fichier. Pour ce faire, la m&eacute;tadonn&eacute;e doit &ecirc;tre ajust&eacute;e aux jeux de m&eacute;tadonn&eacute;es disponibles dans la collection.</p>

<p>L'Interface Biblioth&eacute;caire invite &agrave; fournir les informations n&eacute;cessaires. L'invite donne de br&egrave;ves instructions puis affiche le nom de l'&eacute;l&eacute;ment de m&eacute;tadonn&eacute;es en cours d'importation tel qu&rsquo;il appara&icirc;t dans le fichier source. Ce champ ne peut &ecirc;tre ni modifi&eacute; ni remplac&eacute;. Puis on choisit le jeu de m&eacute;tadonn&eacute;es sur lequel le nouveau &eacute;l&eacute;ment doit &ecirc;tre calqu&eacute; et enfin l'&eacute;l&eacute;ment de m&eacute;tadonn&eacute;es appropri&eacute;. Le syt&egrave;me propose automatiquement le meilleur ajustement, en terme de jeu et d'&eacute;l&eacute;ment pour la nouvelle m&eacute;tadonn&eacute;e.</p>

<p>Apr&egrave;s cela, on peut choisir &laquo;Ajouter&raquo; pour ajouter le nouvel &eacute;l&eacute;ment de m&eacute;ta-donn&eacute;es au jeu de m&eacute;tadonn&eacute;es choisi. (Ceci n'est possible que si aucun &eacute;lement de m&ecirc;me nom n'est pr&eacute;sent &agrave; l'interieur du jeu choisi.) &laquo;Fusionner&raquo; applique le nouvel &eacute;lement &agrave; celui choisi par l'utilisateur. Enfin, &laquo;Ignorer&raquo; n'importe aucune m&eacute;ta-donn&eacute;e avec ce nom d'&eacute;lement. Une fois pr&eacute;cis&eacute;e la mani&egrave;re d'importer un certain &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es, cette information est retenue pour la dur&eacute;e de vie de la collection.</p>

<p>Pour des d&eacute;tails concenant les fichiers m&eacute;tadonn&eacute;e.xml que Greenstone utilise pour sauvegarder les m&eacute;tadonn&eacute;es, r&eacute;f&eacute;rez-vous au chapitre 2 du guide du D&eacute;veloppeur de Greenstone -- &laquo;Exploitez vos documents au maximum&raquo;.</p>

</body>
</html>
