<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="ofmiceandmenus"><font size="5" face="Verdana"><strong>1.1: A propos de la souris et des menus</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section fournit une information de base sur la mani&egrave;re de dialoguer avec l'Interface Biblioth&eacute;caire. Si vous &ecirc;tes familier de programmes comme Internet Explorer ou Microsoft Office et &agrave; l'aise avec l'utilisation des menus et de la souris, passer &agrave; la section <a href="howtoavoidthisdocument.htm">Comment &eacute;viter de lire ce document</a>.</p>

<p>L'Interface Biblioth&eacute;caire suit les conventions de Microsoft Windows et requiert une connaissance de base de Windows.</p>

<p>Un &eacute;l&eacute;ment interactif quelconque sur l'&eacute;cran, tel qu'un bouton ou un champ de texte, est appel&eacute; &laquo;widget&raquo;. A tout moment, l'un des widgets appel&eacute; &laquo;focus&raquo; est mis en relief et r&eacute;pond au clavier. Plusieurs widgets vous permettent de s&eacute;lectionner les parties qui sont mises en &eacute;vidence en bleu fonc&eacute;. Certains widgets virent au gris pour indiquer qu'ils sont d&eacute;sactiv&eacute;s.</p>

<p>On peut d&eacute;placer la souris, cliquer sur son bouton gauche (clic gauche) ou sur son bouton droit (clic droit) de fa&ccedil;on tout &agrave; fait usuelle. Plusieurs &eacute;l&eacute;ments sont susceptibles d'&ecirc;tre entra&icirc;n&eacute;s par glissement de la souris, son bouton gauche &eacute;tant maintenu appuy&eacute;, et d'&ecirc;tre ainsi d&eacute;pos&eacute;s ailleurs en rel&acirc;chant le bouton. Lorsqu'un &eacute;l&eacute;ment est &laquo;gliss&eacute;&raquo; sur une cible susceptible de l'accueillir, celle-ci change d'apparence.</p>

<p>On utilise le clavier pour entrer des donn&eacute;es dans les champs de texte. La touche [tab] permet de naviguer entre les diff&eacute;rents champs.</p>

<p>Pour quitter l'Interface Biblioth&eacute;caire, choisir &laquo;Sortir&raquo; dans le menu &laquo;Fichier&raquo;. La collection active sera alors automatiquement sauvegard&eacute;e.</p>

</body>
</html>
