<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="openingacollection"><font size="5" face="Verdana"><strong>2.3: Ouvrir une collection existante</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Pour ouvrir une collection existante, choisir &laquo;Ouvrir&raquo; dans le menu &laquo;Fichier&raquo; pour obtenir une nouvelle fen&ecirc;tre de dialogue. Une liste de vos collections Greenstone appara&icirc;t. En s&eacute;lectionner une pour voir sa description puis cliquer sur &laquo;Ouvrir&raquo; pour l'activer.</p>

<p>Au cas o&ugrave; plusieurs programmes de l'Interface Biblioth&eacute;caire de Greenstone seraient ex&eacute;cut&eacute;s simultan&eacute;ment, les r&eacute;pertoires concern&eacute;s seront verrouill&eacute;s pour pr&eacute;venir toute interf&eacute;rence. A l'ouverture d'une collection, un petit fichier de verrouillage temporaire est cr&eacute;&eacute; dans son dossier. Avant d'ouvrir une collection, l'Interface Biblioth&eacute;caire v&eacute;rifie qu'aucun fichier de verrouillage n'existe d&eacute;j&agrave;. Cependant, lorsqu'on quitte l'Interface Biblioth&eacute;caire pr&eacute;matur&eacute;ment, le fichier de verrouillage est parfois conserv&eacute;. Lorsqu'une collection est ouverte, l'Interface Biblioth&eacute;caire demande si l'on veut &laquo;voler&raquo; ce contr&ocirc;le. Vous &ecirc;tes libre de le faire, mais prenez garde que personne d'autre ne travaille sur la m&ecirc;me collection au m&ecirc;me moment.</p>

<p>Si vous ouvrez une collection qui n'a pas &eacute;t&eacute; cr&eacute;&eacute;e par l'Interface Biblioth&eacute;caire de Greenstone, le jeu de m&eacute;tadonn&eacute;es Dublin Core lui sera attribu&eacute;, et les m&eacute;tadonn&eacute;es existantes seront import&eacute;es telles quelles lorsque vous ajoutez des fichiers contenant des m&eacute;tadonn&eacute;es. Ce processus est d&eacute;crit dans la section <a href="importingpreviouslyassignedmetadata.htm">Importer des m&eacute;tadonn&eacute;es pr&eacute;-attribu&eacute;es</a>.</p>

</body>
</html>
