<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="partitionindexes"><font size="5" face="Verdana"><strong>6.4: Index de partition</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les index sont construits &agrave; partir de sources de texte ou de m&eacute;tadonn&eacute;es. Le domaine de recherche peut &ecirc;tre affin&eacute; en partitionnant l'index soit par langue soit par un filtre choisi d'avance. Cette section d&eacute;crit la proc&eacute;dure &agrave; suivre pour cela. Dans la vue &laquo;Param&eacute;trer&raquo;, cliquez sur &laquo;Index de partition&raquo;. </p>

<p>Le panneau &laquo;Index de partition&raquo; poss&egrave;de trois onglets : &laquo;D&eacute;finir les Filtres&raquo;, &laquo;Attribuer des partitions&raquo; et &laquo;Attribuer langues&raquo;. Pour en savoir davantage sur les partitions, lisez les paragraphes sur les sous-collections et les sous-index au chapitre 2 du Guide du D&eacute;veloppeur Greenstone.</p>

<p>Pour les collections sous MG, le nombre total de partitions g&eacute;n&eacute;r&eacute;es est une combinaison de tous les index, des filtres de sous-collection et des langues choisies. Deux index avec deux filtres de sous-collection en deux langues donnent huit partitions d'index. Pour MGPP, tous les index sont cr&eacute;&eacute;s dans un seul index physique, de sorte &agrave; ce qu&rsquo;il n'y ait que quatre partitions d'index. Pour Lucene, le nombre d'index physiques d&eacute;pend du nombre de niveaux assign&eacute;s &agrave; la collection, donc un index par niveau. Dans le cas ci-dessus, un niveau donnerait donc quatre index physiques, tandis que deux niveaux en donneraient huit.</p>




</body>
</html>
