<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="plugins"><font size="5" face="Verdana"><strong>6.2: Plugiciels de document</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section d&eacute;crit comment configurer les plugiciels de document que la collection utilise. Elle explique comment sp&eacute;cifier les plugiciels &agrave; utiliser, quels param&egrave;tres leur signifier et dans quel ordre ils se d&eacute;roulent. Dans la vue &laquo;Param&eacute;trer&raquo;, cliquez sur &laquo;Plugiciels de document&raquo;.</p>

<p>Pour ajouter un plugiciel, s&eacute;lectionnez-le &agrave; partir de la liste d&eacute;roulante &laquo;Choisir le plugiciel &agrave; ajouter&raquo; situ&eacute;e en bas de page et ensuite cliquez sur &laquo;Ajouter plugiciel&raquo;. Une fen&ecirc;tre d&eacute;nomm&eacute;e &laquo;Veuillez configurer les arguments&raquo; appara&icirc;t; elle est d&eacute;crite plus loin. Une fois la configuration du nouveau plugiciel achev&eacute;e, il est ajout&eacute; &agrave; la fin de la liste &laquo;Plugiciels attribu&eacute;s&raquo;. Veuillez noter qu'en g&eacute;n&eacute;ral chaque plugiciel n'appara&icirc;t qu'une seule fois dans la liste. Cependant, un plugiciel peut appara&icirc;tre plusieurs fois ; pour que ceci soit utile il faut normalement param&eacute;trer diff&eacute;remment les occurrences multiples d'un plugiciel (par exemple en activant le param&egrave;tre process_exp, voir http://wiki.greenstone.org/wiki/gsdoc/tutorial/en/enhanced_pdf.htm ).</p>

<p>Pour voir une br&egrave;ve description d'un plugiciel, s&eacute;lectionnez-le dans la liste d&eacute;roulante &laquo;Choisir le plugiciel &agrave; ajouter&raquo;, puis placez le curseur dessus. Une infobulle affichant la description appara&icirc;tra.</p>

<p>Pour enlever un plugiciel, s&eacute;lectionnez-le dans la liste et cliquez sur &laquo;Supprimer plugiciel&raquo;.</p>

<p>Les plugiciels sont configur&eacute;s en fournissant des arguments. Pour les modifier ces arguments, il faut s&eacute;lectionner le plugiciel &agrave; partir de la liste et cliquez sur &laquo;Configurer plugiciel&raquo; (Ou double-cliquez sur le plugiciel). Une fen&ecirc;tre de dialogue &laquo;Veuillez configurer les arguments&raquo; appara&icirc;t avec diff&eacute;rents contr&ocirc;les pour sp&eacute;cifier les arguments.</p>

<p>Il existe plusieurs types de contr&ocirc;les. Certains sont des bo&icirc;tes de dialogue et cliquer sur l'une ajoute l'option appropri&eacute;e au plugiciel. Les autres sont des cha&icirc;nes de textes avec une bo&icirc;te de dialogue et un champ texte. Cliquez sur la bo&icirc;te pour activer l'argument, ensuite saisissez le texte appropri&eacute; dans la bo&icirc;te (expression normale, chemin de fichier, etc...). Les autres sont des menus d&eacute;roulants &agrave; partir desquels on peut s&eacute;lectionner un &eacute;l&eacute;ment parmi une s&eacute;rie de valeurs d&eacute;termin&eacute;es. Pour apprendre ce qu'un argument peut faire, placez la souris sur son nom pendant un instant, une description appara&icirc;tra.</p>

<p>Apr&egrave;s avoir modifi&eacute; la configuration, cliquez sur &laquo;OK&raquo; pour valider et fermer la bo&icirc;te de dialogue, ou &laquo;Annuler&raquo; pour fermer la bo&icirc;te de dialogue sans modifier les arguments du plugiciel.</p>

<p>Les plugiciels dans la liste sont ex&eacute;cut&eacute;s dans l'ordre et l'ordre peut &ecirc;tre important. Pour modifier cet ordre s&eacute;lectionnez un plugiciel dans la liste et utilisez les boutons "D&eacute;placer vers le haut" et "D&eacute;placer vers le bas".</p>

</body>
</html>
