<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="preferences"><font size="5" face="Verdana"><strong>9.1: Pr&eacute;f&eacute;rences</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section explique le panneau des pr&eacute;f&eacute;rences, auquel on acc&egrave;de en ouvrant &laquo;Fichier&raquo; -&gt; &laquo;Pr&eacute;f&eacute;rences&raquo;. </p>

<p>Le panneau des pr&eacute;f&eacute;rences s'ouvre en affichant l'onglet &laquo;G&eacute;n&eacute;ral&raquo;. La premi&egrave;re option est un champ texte pour saisir votre adresse e-mail. Ceci sera utilis&eacute; pour les &eacute;l&eacute;ments de m&eacute;tadonn&eacute;es &laquo;cr&eacute;ateur&raquo; et &laquo;responsable maintenance&raquo; de la nouvelle collection. L'option suivante est une liste d&eacute;roulante des langues dans lesquelles l'interface bibioth&eacute;caire peut &ecirc;tre affich&eacute;e. Si on change la langue par le choix d'une autre dans la liste, l'Interface Biblioth&eacute;caire red&eacute;marrera pour charger la nouvelle langue. Un champ texte pour sp&eacute;cifier la police est aussi pr&eacute;sent&eacute; : un bon choix pour afficher du texte en Unicode est "Arial Unicode MS, BOLD, 14".</p>

<p>Si on coche &laquo;Visualiser les m&eacute;tadonn&eacute;es extraites&raquo;, les diff&eacute;rents contr&ocirc;les relatifs aux m&eacute;tadonn&eacute;es affichent toujours toutes les m&eacute;tadonn&eacute;es qui ont &eacute;t&eacute; extraites automatiquement des documents. Lorsqu'on le d&eacute;s&eacute;lectionne, ces m&eacute;tadonn&eacute;es sont cach&eacute;es (bien qu'elles restent disponibles pendant la constitution de la collection, et dans la collection Greenstone finale). Si on coche &laquo;Montrer les tailles des fichiers&raquo;, la taille du fichier appara&icirc;t &agrave; c&ocirc;t&eacute; de chaque fichier dans l'Espace de travail et dans les Arborescences de fichiers des collections dans les vues Rassembler et Enrichir.</p>

<p>Le onglet &laquo;Mode&raquo; est utilis&eacute; pour contr&ocirc;ler le niveau du d&eacute;tail dans l'interface. Dans sa configuration la plus &eacute;l&eacute;mentaire, &laquo;Assistant Biblioth&eacute;caire&raquo;, les vues &laquo;Param&eacute;trer&raquo; et &laquo;Formater" sont d&eacute;sactiv&eacute;es. L'utilisateur peut ajouter/enlever des documents, ajouter/modifier des m&eacute;tadonn&eacute;es, et reconstruire la collection. La vue &laquo;Cr&eacute;er&raquo; est pr&eacute;sent&eacute;e en forme simple. Le mode suivant, &laquo;Biblioth&eacute;caire"&raquo;, donne acc&egrave;s &agrave; toutes les fonctions de param&eacute;trage et de formatage, mais avec la forme simple de la vue &laquo;Cr&eacute;er&raquo;. Le mode le plus avanc&eacute;, &laquo;Expert&raquo;, donne l'acc&egrave;s &agrave; la vue &laquo;Cr&eacute;er&raquo; enti&egrave;re, et permet l'enregistrement dans les historiques de l'int&eacute;gralit&eacute; des messages g&eacute;n&eacute;r&eacute;s lors de la construction de la collection. Pour s&eacute;lectionner ou voir le descriptif d'un mode, cliquez sur le bouton radio situ&eacute; &agrave; c&ocirc;t&eacute; du mode qui vous int&eacute;resse. Vous pouvez contr&ocirc;ler rapidement le mode dans lequel vous vous trouvez en regardant la barre de titre de l'Interface Biblioth&eacute;caire.</p>

<p>L'onglet &laquo;Connexion&raquo; permet de modifier le chemin vers le serveur de biblioth&egrave;que local bas&eacute; sur Greenstone et utilis&eacute; dans l'aper&ccedil;u des collections. Vous pouvez aussi pr&eacute;ciser le proxy de connexion Internet (c.a.d. pour t&eacute;l&eacute;charger les fichiers; voir la section <a href="downloadingfiles.htm">T&eacute;l&eacute;chargement de fichiers d'Internet</a> pour les details). Cochez la case pour une connexion proxy et donnez l'adresse du proxy et son num&eacute;ro de port. La connexion proxy sera &eacute;tablie apr&egrave;s fermeture du panneau des pr&eacute;f&eacute;rences.</p>

<p>En cours de session, l'Interface Biblioth&eacute;caire peut d&eacute;livrer des messages d'avertissement qui donnent des informations sur des cons&eacute;quences &eacute;ventuellement impr&eacute;vues d'une action. On peut d&eacute;sactiver ces messages en cochant la case &laquo;Ne pas afficher cet avertissement de nouveau&raquo;. On peut r&eacute;activer les messages d'avertissement en utilisant l'onglet &laquo;Avertissements&raquo;. Cochez les cases situ&eacute;es &agrave; c&ocirc;t&eacute; des messages d'avertissement que vous souhaitez voir de nouveau. </p>

</body>
</html>
