<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="reviewingmetadata"><font size="5" face="Verdana"><strong>5.6: Passer en revue les m&eacute;tadonn&eacute;es attribu&eacute;es</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>On a parfois besoin de visionner, d&rsquo;un seul coup d&rsquo;oeil, les m&eacute;tadonn&eacute;es attribu&eacute;es &agrave; plusieurs fichiers -- par exemple, pour d&eacute;terminer combien de fichiers restent &agrave; traiter, ou pour avoir une id&eacute;e de l'&eacute;ventail des dates d'attribution.</p>

<p>S&eacute;lectionnez les fichiers que vous souhaitez examiner dans l'Arborescence de la collection, puis cliquez sur le bouton droit de la souris et choisissez &laquo;M&eacute;tadonn&eacute;es attribu&eacute;es ...&raquo;. Une fen&ecirc;tre appel&eacute;e &laquo;Toutes les m&eacute;tadonn&eacute;es&raquo; appara&icirc;t sous forme d'un grand tableau avec plusieurs colonnes. La premi&egrave;re colonne affiche les noms de fichiers ; les lignes affichent toutes les valeurs de m&eacute;tadonn&eacute;es attribu&eacute;es &agrave; ces fichiers.</p>

<p>Afficher le tableau peut prendre un peu de temps si les fichiers s&eacute;lectionn&eacute;s sont nombreux. On peut continuer &agrave; utiliser l'Interface Biblioth&eacute;caire pendant que la fen&ecirc;tre &laquo;Toutes les m&eacute;ta-donn&eacute;es&raquo; est ouverte.</p>

<p>Quand il devient trop large, on peut filtrer le tableau &laquo;Toutes les M&eacute;tadonn&eacute;es&raquo; en appliquant des filtres aux colonnes. Quand on ajoute de nouveaux filtres, seules les lignes correspondantes restent visibles. Pour installer, modifier ou effacer un filtre, cliquez sur l'ic&ocirc;ne &laquo;Filtre&raquo; situ&eacute; en haut de la colonne. Une information sur le filtre est r&eacute;clam&eacute;e. Une fois le filtre install&eacute;, l'en-t&ecirc;te de la colonne change de couleur. </p>

<p>La fen&ecirc;tre de d&eacute;finition du filtre poss&egrave;de deux onglets : &laquo;simple&raquo; et &laquo;avanc&eacute;&raquo;. La version simple filtre les colonnes afin qu'elles n'affichent que les lignes qui contiennent une valeur d&eacute;finie (&laquo;*&raquo; correspond &agrave; toute valeur). On peut s&eacute;lectionner des valeurs de m&eacute;tadonn&eacute;es &agrave; partir d'une liste d&eacute;roulante. La version avanc&eacute;e permet diff&eacute;rentes op&eacute;rations de correspondance : doit commencer par, ne contient pas, alphab&eacute;tiquement inf&eacute;rieur, et est &eacute;gal &agrave;. La valeur de r&eacute;f&eacute;rence peut &ecirc;tre n'importe cha&icirc;ne de caract&egrave;res (y compris &laquo;*&raquo;), et on peut opter pour une correspondance qui ne respecte pas la casse. On peut aussi sp&eacute;cifier une deuxi&egrave;me condition de correspondance en donnant un &eacute;ventail de valeurs (et en s&eacute;lectionnant AND) ou des valeurs alternatives (en s&eacute;lectionnant OR). Au-dessous de cette zone, il y a une bo&icirc;te qui permet de modifier l'ordre du tri (ascendant ou descendant). A la fin, cliquez sur &laquo;Installer Filtre&raquo; pour appliquer le nouveau filtre &agrave; la colonne. Cliquez sur &laquo;Effacer Filtre&raquo; pour retirer le filtre courant. Les d&eacute;tails du filtre restent m&eacute;moris&eacute;s m&ecirc;me si le filtre est effac&eacute;. </p>

<p>Par exemple, pour trier le tableau &laquo;Toutes les m&eacute;tadonn&eacute;es&raquo;, choisissez une colonne, s&eacute;lectionnez le cadre du filtre par d&eacute;faut (Un filtre simple sur &laquo;*&raquo;) et choisissez un ordre ascendant ou descendant. </p>

</body>
</html>
