<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="searchindexoptions"><font size="5" face="Verdana"><strong>6.3.1: Options d'index de recherche</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Des options suppl&eacute;mentaires contr&ocirc;lent la construction des index. Celles-ci peuvent ne pas &ecirc;tre disponibles pour un type d'index sp&eacute;cifque, alors elles appara&icirc;tront gris&eacute;es.</p>

<p>Pour les index MG et MGPP, les options &laquo;Ignorer terminaisons&raquo; et &laquo;Ignorer casse&raquo; peuvent &ecirc;tre activ&eacute;es ou d&eacute;sactiv&eacute;es. Si elles sont activ&eacute;es, les index permettant d'ignorer les terminaisons ou la casse seront cr&eacute;&eacute;s, et l'utilisateur pourra choisir d'effectuer les recherches avec ou sans l'option concern&eacute;e. Si elles sont inactives, les recherches prendront en compte la casse et les terminaisons, et les options de les ignorer ne seront pas affich&eacute;es sur la page des pr&eacute;f&eacute;rences de la collection.</p>

<p>&laquo;Ignorer accents&raquo; est &eacute;galement disponible pour un index MGPP. Cela fonctionne d'une mani&egrave;re similaire &agrave; &laquo;Ignorer casse&raquo;, mais au lieu de faire correspondre les lettres majuscules et minuscules, les lettres avec accents correspondent &agrave; celles sans accents. Pour les index Lucene, les accents sont toujours ignor&eacute;s, aucun choix pour activer ou d&eacute;sactiver cette option ne sera pr&eacute;sent&eacute;e sur la page des pr&eacute;f&eacute;rences de la collection.</p>

<p>Les textes en chinois, japonais ou cor&eacute;en sont souvent &eacute;crits en caract&egrave;res continus sans s&eacute;paration des mots. Comme l'indexation d&eacute;pend des espaces entre les mots dans le texte, l'absence d'espaces rend l'index inexploitable. S&eacute;lectionner l'option "Segmentation de texte CJK" a pour effet d'inserer des espaces entre caract&egrave;res voisins chinois/japonais/cor&eacute;ens dans le texte et dans les mots recherch&eacute;s, pour qu'une recherche au niveau des caract&egrave;res soit effectu&eacute;e. </p>

</body>
</html>
