<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="searchindexes"><font size="5" face="Verdana"><strong>6.3: Index de recherche</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les index pr&eacute;cisent les parties de la collection qui peuvent &ecirc;tre recherch&eacute;es. Cette section explique comment ajouter et supprimer des index et d&eacute;finir un index par d&eacute;faut. Dans la vue "Param&eacute;trer", cliquez sur "Index de recherche".</p>

<p>La partie en haut &agrave; droite du panneau "Index de recherche" affiche des informations sur le moteur de recherche utilis&eacute; par la collection. Ceci peut &ecirc;tre modifi&eacute; en cliquant sur "Modifier ...". Une fen&ecirc;tre secondaire appara&icirc;t avec la liste d'options : MG, MGPP et Lucene. Modifier ceci affecte la fa&ccedil;on dont les index sont construits, et peut affecter la fonctionnalit&eacute; de recherche.</p>

<p>La liste "Index attribu&eacute;s" affiche les index actuellement attribu&eacute;s &agrave; la collection.</p>

<p>Pour ajouter un index, cliquez sur "Nouvel index" ... Une fen&ecirc;tre secondaire appara&icirc;t avec une liste de sources qui contient le texte et les m&eacute;tadonn&eacute;es. S&eacute;lectionnez les sources que vous souhaitez indexer. Les  boutons "Tout s&eacute;lectionner" et "Ne rien s&eacute;lectionner" sont utilis&eacute;s pour cocher ou d&eacute;cocher tous les &eacute;l&eacute;ments de la liste. Une fois le nouvel index d&eacute;fini, cliquez sur "Ajouter index" pour l'ajouter &agrave; la collection. "Ajouter index" ne deviendra actif que si les param&egrave;tres qui d&eacute;crivent le nouvel index n&rsquo;ont pas d&eacute;j&agrave; &eacute;t&eacute; attribu&eacute;s &agrave; la collection.</p>

<p>Pour les index MG, vous devez aussi choisir la granularit&eacute; de l'index en utilisant le menu "Niveau d'indexation :".</p>

<p>Pour un index MGPP ou Lucene, la granularit&eacute; de l'index est d&eacute;termin&eacute;e globalement, et non par l'index. Les niveaux possibles sont affich&eacute;s sur le panneau principal "Index de recherche", et peuvent &ecirc;tre ajout&eacute;s &agrave; la collection en cochant les cases correspondantes.</p>

<p>Un index particulier est disponible sous MGPP et Lucene : un index &laquo;tous champs&raquo;, qui donne la possibilit&eacute; d'une recherche combin&eacute;e sur tous les index sp&eacute;cifi&eacute;s, sans avoir &agrave; pr&eacute;ciser un index autre qui contiendrait tous ces &eacute;l&eacute;ments. Pour ajouter cet index, cochez la case "Ajouter une recherche combin&eacute;e sur tous les index" et cliquez sur "Ajouter index".</p>

<p>Pour MGPP et Lucene, un bouton "Ajouter tout" est &eacute;galement disponible. Il s&rsquo;agit d'un raccourci pour ajouter toutes les m&eacute;tadonn&eacute;es ainsi que le texte int&eacute;gral en tant qu'index individuels.</p>

<p>Pour modifier un index, s&eacute;lectionnez-le et cliquez sur "Modifier l'index". Une bo&icirc;te de dialogue similaire &agrave; "Nouvel index" est affich&eacute;e.</p>

<p>Pour supprimer un index, s&eacute;lectionnez-le dans la liste des Index attribu&eacute;s et cliquez sur "Supprimer index".</p>

<p>L'ordre dans lequel les index sont sp&eacute;cifi&eacute;s dans la liste &laquo;Index attribu&eacute;s&raquo; est celui dans lequel ils apparara&icirc;tront dans la liste d&eacute;roulante de la page de recherche. Utilisez les boutons "D&eacute;placer vers le haut" et "D&eacute;placer vers le bas" pour modifier cet ordre.</p>

<p>Celui qui est s&eacute;lectionn&eacute; par d&eacute;faut sur la page de recherche est appel&eacute; &laquo;index par d&eacute;faut&raquo;. Ceci peut &ecirc;tre d&eacute;fini en s&eacute;lectionnant un index de la liste et en cliquant sur &laquo;D&eacute;finir l'index par d&eacute;faut&raquo;. L'index par d&eacute;faut est identifi&eacute; par "[Index par d&eacute;faut]" dans la liste &laquo;Index attribu&eacute;s&raquo;. Si aucun index n'est d&eacute;fini par d&eacute;faut, le premier index de la liste sera utilis&eacute; par d&eacute;faut.</p>

<p>Les noms pr&eacute;sent&eacute;s dans la liste d&eacute;roulante d'index sur la page de recherche peuvent &ecirc;tre d&eacute;finis dans le panneau "Recherches" de la vue "Formater" (voir <a href="searchmetadatasettings.htm">Recherches</a>).</p>


</body>
</html>
