<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="selectingmetadatasets"><font size="5" face="Verdana"><strong>5.2: S&eacute;lectionner les jeux de m&eacute;tadonn&eacute;es</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Les s&eacute;ries d'&eacute;l&eacute;ments de m&eacute;tadonn&eacute;es pr&eacute;d&eacute;finis sont appel&eacute;es &laquo;jeux de m&eacute;tadonn&eacute;es&raquo;. &laquo;Dublin Core&raquo; en est un exemple. Quand on ajoute un jeu de m&eacute;tadonn&eacute;es &agrave; la collection, les &eacute;l&eacute;ments de ce jeu peuvent &ecirc;tre s&eacute;lectionn&eacute;s. On peut avoir plus d'un jeu de m&eacute;tadonn&eacute;es ; pour &eacute;viter des t&eacute;lescopages de nom, une abr&eacute;viation qui identifie le jeu de m&eacute;tadonn&eacute;es est accol&eacute;e au nom de l'&eacute;l&eacute;ment. Par exemple l'&eacute;lement &laquo;Cr&eacute;ateur&raquo; de Dublin Core devient &laquo;dc.Creator&raquo;. Les jeux de m&eacute;tadonn&eacute;es sont sauvegard&eacute;s dans le dossier de m&eacute;tadonn&eacute;es de l'Interface Biblioth&eacute;caire avec le suffixe &laquo;.mds&raquo;.</p>

<p>Quand on cr&eacute;e une nouvelle collection, le jeu de m&eacute;tadonn&eacute;es Dublin Core est ajout&eacute; par d&eacute;faut. Il est possible de modifier les jeux de m&eacute;tadonn&eacute;es utilis&eacute;s dans une collection, en cliquant sur le bouton "G&eacute;rer les jeux de m&eacute;tadonn&eacute;es ..." au-dessous de l'Arborescence de la collection dans la vue &laquo;Enrichir&raquo;. Ceci fait appara&icirc;tre une nouvelle fen&ecirc;tre pour g&eacute;rer les jeux de m&eacute;tadonn&eacute;es de la collection.</p>

<p>La liste "Jeux de m&eacute;tadonn&eacute;es affect&eacute;s" vous montre quels jeux sont actuellement utilis&eacute;s par la collection.</p>

<p>Pour utiliser un autre jeu de m&eacute;tadonn&eacute;es avec la collection charg&eacute;e, cliquez sur &laquo;Ajouter...&raquo;. Une fen&ecirc;tre secondaire affiche les jeux de m&eacute;tadonn&eacute;es que GLI reconna&icirc;t par d&eacute;faut. Pour ajouter l'un d'eux, s&eacute;lectionnez-le dans la liste et cliquez sur &laquo;Ajouter&raquo;. Si vous avez d&eacute;fini votre propre jeu de m&eacute;tadonn&eacute;es, vous pouvez utiliser le bouton &laquo;Parcourir&raquo; pour s&eacute;lectionner le fichier dans votre syst&egrave;me de fichiers.</p>

<p>Pour cr&eacute;er un nouveau jeu de m&eacute;tadonn&eacute;es, cliquez sur &laquo;Nouveau ...&raquo;. Cette op&eacute;ration lance l'Editeur de jeux de m&eacute;tadon&eacute;es de Greenstone, GEMS. Une premi&egrave;re fen&ecirc;tre vous invite &agrave; entrer le nom du jeu de m&eacute;tadonn&eacute;es, l'espace de noms et la description. Vous pouvez &eacute;galement choisir de baser le nouveau jeu sur un jeu existant, dans ce cas il h&eacute;ritera de tous les &eacute;l&eacute;ments du jeu sp&eacute;cifi&eacute;. Cliquez sur OK. La fen&ecirc;tre principale liste les &eacute;l&eacute;ments du jeu de m&eacute;tadonn&eacute;es sur le c&ocirc;t&eacute; gauche, et certains attributs du jeu sur le c&ocirc;t&eacute; droit. Si vous avez un jeu bas&eacute; sur un jeu existant, un ou plusieurs &eacute;l&eacute;ments seront d&eacute;j&agrave; affich&eacute;s. En cliquant sur un &eacute;l&eacute;m&eacute;nt, les attributs de cet &eacute;l&eacute;ment s&rsquo;affichent dans la partie droite.</p>

<p>Pour ajouter un nouvel &eacute;l&eacute;ment, clic droit sur le nom du jeu et choisissez &laquo;Ajouter un &eacute;l&eacute;ment&raquo;. Pour ajouter un nouveau sous-&eacute;l&eacute;ment, clic droit sur l'&eacute;l&eacute;ment et choisir &laquo;Ajouter un sous-&eacute;l&eacute;ment&raquo;. &Eacute;l&eacute;ments et sous-&eacute;l&eacute;ments peuvent &ecirc;tre supprim&eacute;es en s&eacute;lectionnant &laquo;Supprimer un &eacute;l&eacute;ment&raquo; dans le menu du clic droit.</p>

<p>Nota Bene : L'&eacute;diteur de jeux de m&eacute;tadonn&eacute;es Greenstone GEMS peut &ecirc;tre ex&eacute;cut&eacute; ind&eacute;pendamment de GLI en le s&eacute;lectionnant dans le dossier Greenstone du menu D&eacute;marrer, ou en ex&eacute;cutant gems.sh ou gems.bat dans le dossier gli de votre installation Greenstone.</p>

<p>Parfois deux jeux de m&eacute;tadonn&eacute;es peuvent avoir le m&ecirc;me espace de noms, par exemple, le Dublin Core et Dublin Core qualifi&eacute; utilisent l'espace de noms &laquo;dc&raquo;. De tels jeux ne peuvent pas &ecirc;tre utilis&eacute;s dans une collection en m&ecirc;me temps. Si vous essayez d'ajouter un jeu avec un espace de noms d&eacute;j&agrave; utilis&eacute; par la collection, un avertissement s'affiche. Si vous continuez, le jeu existant sera supprim&eacute; et le nouveau ajout&eacute;. Toutes les valeurs de m&eacute;tadonn&eacute;es d&eacute;j&agrave; attribu&eacute;es seront transf&eacute;r&eacute;es au nouveau jeu si tant est que les &eacute;l&eacute;ments existent toujours.</p>

<p>L'&eacute;dition des jeux de m&eacute;tadonn&eacute;es, ainsi que la cr&eacute;ation de nouveaux jeux, se font avec l'&eacute;diteur Greenstone de m&eacute;tadonn&eacute;es (GEMS). En cliquant sur le bouton &laquo;Modifier...&raquo; vous lancez GEMS avec le jeu de m&eacute;tadonn&eacute;es sp&eacute;cifi&eacute; ouvert. Quand vous avez termin&eacute; la r&eacute;vision du jeu (comme d&eacute;crit ci-dessus), sauvegardez le jeu (Fichier-&gt;Sauvegarder) et fermez GEMS.</p>

<p>Si vous n'avez plus besoin d'un jeu de m&eacute;tadonn&eacute;es dans une collection, s&eacute;lectionnez le jeu et cliquez sur &laquo;Retirer&raquo; pour l'enlever. Si vous avez attribu&eacute; des m&eacute;tadonn&eacute;es aux &eacute;l&eacute;ments du jeu retir&eacute;, on vous demandera ce que vous voulez en faire lorsque vous allez ouvrir &agrave; nouveau cette collection.</p>

</body>
</html>
