<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="theenrichview"><font size="5" face="Verdana"><strong>5.1: La vue &laquo;Enrichir&raquo;</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Utilisez la vue "Enrichir" pour attribuer des m&eacute;tadonn&eacute;es aux documents de la collection. Une m&eacute;tadonn&eacute;e est une donn&eacute;e servant &agrave; d&eacute;finir ou &agrave; d&eacute;crire une autre donn&eacute;e -- habituellement le titre, l'auteur, la date de cr&eacute;ation, etc... Chaque &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es a deux parties : "El&eacute;ment" indique le type d'&eacute;l&eacute;ment (par exemple auteur), et "Valeur" qui donne la valeur de cet &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es (par exemple le nom de l'auteur).</p>

<p>Sur la gauche de la vue "Enrichir" il y a l'Arborescence de la collection. Toutes les fonctions op&eacute;rant sur l'Arborescence de la collection dans la vue "Rassembler" sont &eacute;galement disponibles ici. A droite, il s'agit de la Table de m&eacute;tadonn&eacute;es, qui affiche les m&eacute;tadonn&eacute;es pour tout fichier ou dossier s&eacute;lectionn&eacute; dans l'Arborescence de la collection. Les colonnes sont nomm&eacute;es en noir en haut de colonne, et peuvent &ecirc;tre redimensionn&eacute;es en faisant glisser la ligne de s&eacute;paration. Si plusieurs fichiers ou dossiers sont s&eacute;lectionn&eacute;s, un texte en noir indique que la valeur est commune &agrave; tous les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s, tandis qu'un texte en gris indique le contraire. La modification des valeurs en gris affecte seulement les documents auxquels ces valeurs ont &eacute;t&eacute; attribu&eacute;s. Toute nouvelle valeur saisie sera ajout&eacute;e &agrave; tous les &eacute;l&eacute;ments s&eacute;lectionn&eacute;s.</p>

<p>Une ic&ocirc;ne repr&eacute;sentant un dossier peut appara&icirc;tre &agrave; c&ocirc;t&eacute; de certaines entr&eacute;es de m&eacute;tadonn&eacute;es. Ceci indique que les valeurs ont &eacute;t&eacute; h&eacute;rit&eacute;es d'un dossier parent (ou anc&ecirc;tre). Les m&eacute;tadonn&eacute;es h&eacute;rit&eacute;es ne peuvent &ecirc;tre modifi&eacute;es ou supprim&eacute;es, mais seulement compl&eacute;t&eacute;es. Cliquez sur l'ic&ocirc;ne du dossier pour aller imm&eacute;diatement au dossier o&ugrave; la m&eacute;tadonn&eacute;e est affect&eacute;e.</p>

<p>Si vous cliquez sur un &eacute;l&eacute;ment de m&eacute;tadonn&eacute;es du tableau, celui-ci affiche les valeurs existantes pour l'&eacute;l&eacute;ment dans la zone "Valeurs existantes pour ..." au-dessous du tableau. Cette "Arborescence de valeurs" peut &ecirc;tre d&eacute;velopp&eacute;e ou r&eacute;duite. C'est une liste qui, de fa&ccedil;on usuelle, affiche toutes les valeurs pr&eacute;c&eacute;demment saisies pour un &eacute;l&eacute;ment s&eacute;lectionn&eacute;. En cliquant sur une entr&eacute;e, on  la place automatiquement dans le champ valeur. Inversement, en tapant une donn&eacute;e dans le champ valeur, on s&eacute;lectionne dans l'Arborescence de valeurs l'&eacute;l&eacute;ment qui d&eacute;bute avec les caract&egrave;res saisis. Appuyer sur [Tab] accepte automatiquement la valeur s&eacute;lectionn&eacute;e.</p>

<p>Les valeurs de m&eacute;tadonn&eacute;es peuvent &ecirc;tre organis&eacute;es en hi&eacute;rarchie. Ceci est visible dans l'Arborescence de valeurs, en utilisant des dossiers pour d&eacute;finir les niveaux internes. Les valeurs hi&eacute;rarchiques peuvent &ecirc;tre saisies en utilisant le caract&egrave;re "|" pour s&eacute;parer les niveaux. Par exemple, "Carte|Rouge|Carreau|Sept" peut &ecirc;tre utilis&eacute; dans une hi&eacute;rarchie qui repr&eacute;sente un jeu de cartes. Cela permet le regroupement des valeurs. Les groupes de valeurs peuvent aussi &ecirc;tre attribu&eacute;s comme m&eacute;tadonn&eacute;es aux documents.</p>

<p>Greenstone extrait automatiquement certaines m&eacute;tadonn&eacute;es &agrave; partir des documents, et les regroupe dans un jeu de m&eacute;tadonn&eacute;es dont les &eacute;l&eacute;ments sont pr&eacute;fix&eacute;s &laquo;ex.&raquo;. Il n&rsquo;y a aucune arborescence de valeurs, cela ne peut &ecirc;tre modifi&eacute;.</p>

</body>
</html>
