<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="thegatherview"><font size="5" face="Verdana"><strong>4.1: La vue &laquo;Rassembler&raquo;</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Cette section introduit la vue Rassembler utilis&eacute;e pour s&eacute;lectionner les fichiers &agrave; inclure dans la collection &agrave; cr&eacute;er. L'Interface Biblioth&eacute;caire d&eacute;marre avec l'affichage &laquo;Rassembler&raquo;. Pour revenir ult&eacute;rieurement &agrave; celui-ci, cliquer directement sur l'onglet "Rassembler" juste en dessous de la barre de menu.</p>

<p>Les deux larges zones intitul&eacute;es &laquo;Espace de travail&raquo; et &laquo;Collection&raquo; servent au transfert des fichiers vers la collection. Elles contiennent chacune une arborescence de fichiers et de dossiers.</p>

<p>Choisir un &eacute;l&eacute;ment dans l'arborescence en cliquant dessus. (Il existe d'autres mani&egrave;res de le faire ; voir ci-dessous). Double-cliquer sur un dossier, ou cliquer simplement sur le symbole petit plus plac&eacute; &agrave; c&ocirc;t&eacute; de lui, pour d&eacute;velopper (ou r&eacute;duire) son contenu. Double-cliquer sur un fichier pour l'ouvrir en utilisant le programme d'application associ&eacute; (voir <a href="fileassociations.htm">Associations de fichiers</a>).</p>

<p>L'arborescence des fichiers de l'espace de travail montre les sources de donn&eacute;es disponibles pour l'Interface Biblioth&eacute;caire -- le syst&egrave;me de fichiers local (ainsi que les unit&eacute;s de disques et Cd-rom), le contenu des collections Greenstone, et le cache des fichiers t&eacute;l&eacute;charg&eacute;s. Vous pouvez copier et afficher ces fichiers mais vous ne pouvez pas les d&eacute;placer, supprimer ou modifier, &agrave; l'exception des fichiers t&eacute;l&eacute;charg&eacute;s qui peuvent &ecirc;tre supprim&eacute;s. Vous pouvez naviguer &agrave; l'int&eacute;rieur de cet espace pour trouver les documents que vous souhaitez ajouter &agrave; la collection.</p>

<p>L'arborescence des fichiers de la Collection ne repr&eacute;sente que le contenu de la collection. Elle est initialement vide.</p>

<p>On peut redimensionner les espaces en positionnant la souris sur la barre grise qui s&eacute;pare les arborescences (le pointeur change de forme) et en la faisant glisser.</p>

<p>En bas de la fen&ecirc;tre, il y a une barre d'&eacute;tat qui montre l'&eacute;volution des op&eacute;rations sur les fichiers (copie, d&eacute;placement et suppression). Ces op&eacute;rations peuvent &ecirc;tre longues. Le bouton &laquo;Arr&ecirc;t&raquo; arr&ecirc;te toute t&acirc;che en cours.</p>

<p>Deux grands boutons occupent le coin inf&eacute;rieur droit de l'&eacute;cran. &laquo;Nouveau dossier&raquo;, avec une image d'un dossier, cr&eacute;e de nouveaux dossiers (voir <a href="creatingfolders.htm">Cr&eacute;er des dossiers</a>). &laquo;Supprimer&raquo;, avec une corbeille, supprime les fichiers. En cliquant sur le bouton &laquo;Supprimer&raquo; vous d&eacute;truisez tous les fichiers s&eacute;lectionn&eacute;s de l'arborescence de fichiers de la collection. On peut aussi supprimer des fichiers en les faisant glisser jusqu'au bouton &laquo;Supprimer&raquo;. </p>

<p>Pour s&eacute;lectionner plusieurs d'&eacute;l&eacute;ments successifs, s&eacute;lectionner le premier, maintenir appuy&eacute;e la touche [Maj] et cliquer sur le dernier &eacute;l&eacute;ment de la s&eacute;quence -- la s&eacute;lection comprendra tous les &eacute;l&eacute;ments compris entre les deux. Pour la s&eacute;lection de fichiers qui ne se suivent pas, maintenir la touche [Ctrl] appuy&eacute;e en cliquant sur chacun d'eux. Ces deux m&eacute;thodes peuvent &ecirc;tre utilis&eacute;es ensemble pour la s&eacute;lection de jeux d'&eacute;l&eacute;ments non adjacents.</p>

</body>
</html>
