<html>
<head>
<META http-equiv="Content-Type" content="text/html; charset=UTF-8">
<title>The Greenstone Librarian Interface - Help Pages</title>
</head>
<body bgcolor="#E0F0E0">
<table width="100%" cellspacing="0" cellpadding="5" bgcolor="#B0D0B0" border="2">
<tr>
<td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td><td width="*" align="center"><a name="xcollectionsearching"><font size="5" face="Verdana"><strong>8.6: Recherches &agrave; travers des collections</strong></font></a></td><td width="15%" align="center"><img width="45" src="../gatherer_medium.gif" height="45"></td>
</tr>
</table>


<p>Greenstone peut rechercher dans plusieurs collections comme si elles n'en constituaient qu'une seule. Ceci est fait en sp&eacute;cifiant une liste d'autres collections dans lesquelles une recherche est effectu&eacute;e en m&ecirc;me temps que dans la collection courante. Dans la vue &laquo;Formater&raquo;, cliquez sur &laquo;Recherches &agrave; travers collections&raquo;.</p>

<p>Le panneau &laquo;Recherches &agrave; travers collections&raquo; montre une liste de collections disponibles. La collection courante est coch&eacute;e et ne peut &ecirc;tre d&eacute;-s&eacute;lectionn&eacute;e. Pour ajouter une autre collection dans laquelle on pourra rechercher parall&egrave;lement, cliquez sur une collection dans la liste (cliquez une deuxi&egrave;me fois pour l'enlever). Lorsqu'une seule collection est s&eacute;lectionn&eacute;e, aucune recherche &agrave; travers les collections n'est possible.</p>

<p>Si les collections individuelles n'ont pas toutes les m&ecirc;mes index (y compris les partitions de sous-collection et les partitions de langue), la recherche &agrave; travers les collections ne pourra pas fonctionner correctement. L'utilisateur ne pourra alors qu'effectuer des recherches en utilisant les index communs &agrave; toutes les collections.</p>

<p>Pour plus de d&eacute;tails, voir le Chapitre 1 du Guide du D&eacute;veloppeur Greenstone.</p>

</body>
</html>
